[
  {
    "rank": "1.",
    "title": "Rocks",
    "release_date": "February 1, 2021",
    "summary": "A teenage girl suddenly finds herself struggling to take care of herself and her younger brother.",
    "metascore": "96",
    "userscore": "6.1",
    "link": "https://www.metacritic.com/movie/rocks"
  },
  {
    "rank": "2.",
    "title": "Quo Vadis, Aida?",
    "release_date": "March 5, 2021",
    "summary": "Bosnia, July 11th 1995.  Aida is a translator for the United Nations in the small town of Srebrenica. When the Serbian army takes over the town, her family is among the thousands of citizens looking for shelter in the UN camp. As an insider to the negotiations Aida has access to crucial information that she needs to interpret. What is at the horizon for her family and people - rescue or death? Which move should she take? [Super LTD]",
    "metascore": "93",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/quo-vadis-aida"
  },
  {
    "rank": "3.",
    "title": "The Human Voice",
    "release_date": "March 12, 2021",
    "summary": "A woman watches time passing next to the suitcases of her ex-lover (who is supposed to come pick them up, but never arrives) and a restless dog who doesn’t understand that his master has abandoned him.",
    "metascore": "89",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-human-voice"
  },
  {
    "rank": "4.",
    "title": "The Father",
    "release_date": "February 26, 2021",
    "summary": "Anthony is 80, mischievous, living defiantly alone and rejecting the carers that his daughter, Anne, encouragingly introduces. Yet help is also becoming a necessity for Anne; she can’t make daily visits anymore and Anthony's grip on reality is unravelling. As we experience the ebb and flow of his memory, how much of his own identity and past can Anthony cling to? How does Anne cope as she grieves the loss of her father, while he still lives and breathes before her?",
    "metascore": "87",
    "userscore": "10",
    "link": "https://www.metacritic.com/movie/the-father"
  },
  {
    "rank": "5.",
    "title": "Hope",
    "release_date": "April 16, 2021",
    "summary": "Anja (Andrea Bræin Hovig) lives with Tomas (Stellan Skarsgård) in a large family of biological children and stepchildren. For a number of years the two adults have grown independent of each other, with creative jobs in parallel worlds. When Anja gets a terminal cancer diagnosis, their modern life breaks down and exposes neglected love. Alone with her grief and her fears, Anja realizes that she needs Tomas’ full help and support. It’s their only chance. How else will their children find the strength once she is gone, if their parents are unable to weather the storm together? Anja and Tomas are thrown into a crash course in mutual trust, and eventually a joint struggle, to deal with this unexpected and premature death. By getting to know each other anew, they unconsciously become principal characters in a love story, finally learning to truly love each other after a long life spent together.",
    "metascore": "86",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/hope"
  },
  {
    "rank": "6.",
    "title": "Judas and the Black Messiah",
    "release_date": "February 12, 2021",
    "summary": "FBI informant William O’Neal (LaKeith Stanfield) infiltrates the Illinois Black Panther Party and is tasked with keeping tabs on their charismatic leader, Chairman Fred Hampton (Daniel Kaluuya). A career thief, O’Neal revels in the danger of manipulating both his comrades and his handler, Special Agent Roy Mitchell (Jesse Plemons). Hampton’s political prowess grows just as he’s falling in love with fellow revolutionary Deborah Johnson (Dominique Fishback). Meanwhile, a battle wages for O’Neal’s soul. Will he align with the forces of good? Or subdue Hampton and The Panthers by any means, as FBI Director J. Edgar Hoover (Martin Sheen) commands?",
    "metascore": "86",
    "userscore": "7.6",
    "link": "https://www.metacritic.com/movie/judas-and-the-black-messiah"
  },
  {
    "rank": "7.",
    "title": "Identifying Features",
    "release_date": "January 22, 2021",
    "summary": "Middle-aged Magdalena (Mercedes Hernandez) has lost contact with her son after he took off with a friend from their town of Guanajuato to cross the border into the U.S., hopeful to find work. Desperate to find out what happened to him—and to know whether or not he’s even alive—she embarks on an ever-expanding and increasingly dangerous journey to discover the truth. At the same time, a young man named Miguel (David Illescas) has returned to Mexico after being deported from the U.S., and eventually his path converges with Magdalena’s.",
    "metascore": "85",
    "userscore": "4.0",
    "link": "https://www.metacritic.com/movie/identifying-features"
  },
  {
    "rank": "8.",
    "title": "Atlantis",
    "release_date": "January 22, 2021",
    "summary": "Eastern Ukraine, 2025. A desert unsuitable for human habitation. Water is a dear commodity brought by trucks. A Wall is being build-up on the border. Sergiy, a former soldier, is having trouble adapting to his new reality. He meets Katya while on the Black Tulip mission dedicated to exhuming the past. Together, they try to return to some sort of normal life in which they are also allowed to fall in love again.",
    "metascore": "85",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/atlantis"
  },
  {
    "rank": "9.",
    "title": "The Truffle Hunters",
    "release_date": "March 5, 2021",
    "summary": "Deep in the forests of Piedmont, Italy, a handful of men, seventy or eighty years young, hunt for the rare and expensive white Alba truffle—which to date has resisted all of modern science's efforts at cultivation. They're guided by a secret culture and training passed down through generations, as well as by the noses of their cherished and expertly-trained dogs. They live a simpler, slower way of life, in harmony with their loyal animals and their picture-perfect land, seemingly straight out of a fairy tale. They're untethered to cell phone screens or the Internet, opting instead to make their food and drink by hand and prioritizing in-person connections and community. \nThe demand for white truffles increases year after year, even as the supply decreases. As a result of climate change, deforestation, and the lack of young people taking up the mantle, the truffle hunters' secrets are more coveted than ever. However, as it soon becomes clear, these ageing men may just hold something much more valuable than even this prized delicacy: the secret to a rich and meaningful life.",
    "metascore": "85",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-truffle-hunters"
  },
  {
    "rank": "10.",
    "title": "About Endlessness",
    "release_date": "April 30, 2021",
    "summary": "About Endlessness is a reflection on human life in all its beauty and cruelty, its splendour and banality. We wander, dreamlike, gently guided by our Scheherazade-esque narrator. Inconsequential moments take on the same significance as historical events: a couple floats over a war-torn Cologne; on the way to a birthday party, a father stops to tie his daughter’s shoelaces in the pouring rain; teenage girls dance outside a café; a defeated army marches to a prisoner of war camp. Simultaneously an ode and a lament, About Endlessness presents a kaleidoscope of all that is eternally human, an infinite story of the vulnerability of existence. [Venice]",
    "metascore": "84",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/about-endlessness"
  },
  {
    "rank": "11.",
    "title": "Stray",
    "release_date": "March 5, 2021",
    "summary": "Stray explores what it means to live as a being without status or security, following three strays as they embark on inconspicuous journeys through Turkish society. Zeytin, fiercely independent, embarks on adventures through the city at night; Nazar, nurturing and protective, easily befriends the humans around her; while Kartal, a shy puppy living on the outskirts of a construction site, finds companions in the security guards who care for her. The strays’ disparate lives intersect when they each form intimate bonds with a group of young Syrians with whom they share the streets.",
    "metascore": "84",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/stray-2021"
  },
  {
    "rank": "12.",
    "title": "Night of the Kings",
    "release_date": "February 26, 2021",
    "summary": "A young man is sent to “La Maca,” a prison in the middle of the Ivorian forest ruled by its inmates. As tradition goes with the rising of the red moon, he is designated by the Boss to be the new “Roman” and must tell a story to the other prisoners. Learning what fate awaits him, he begins to narrate the mystical life of the legendary outlaw named “Zama King” and has no choice but to make his story last until dawn.",
    "metascore": "84",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/night-of-the-kings"
  },
  {
    "rank": "13.",
    "title": "Tina",
    "release_date": "March 27, 2021",
    "summary": "With a wealth of never-before-seen footage, audio tapes, personal photos, and new interviews, including with the singer herself, Tina presents an unvarnished and dynamic account of the life and career of music icon Tina Turner. [HBO]",
    "metascore": "83",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/tina"
  },
  {
    "rank": "14.",
    "title": "The Reason I Jump",
    "release_date": "January 8, 2021",
    "summary": "Based on the best-selling book by Naoki Higashida, The Reason I Jump is an immersive cinematic exploration of neurodiversity through the experiences of nonspeaking autistic people from around the world. The film blends Higashida's revelatory insights into autism, written when he was just 13, with intimate portraits of five remarkable young people. It opens a window for audiences into an intense and overwhelming, but often joyful, sensory universe.",
    "metascore": "83",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-reason-i-jump"
  },
  {
    "rank": "15.",
    "title": "Saint Maud",
    "release_date": "January 29, 2021",
    "summary": "Maud, a newly devout hospice nurse, becomes obsessed with saving her dying patient’s soul — but sinister forces, and her own sinful past, threaten to put an end to her holy calling.",
    "metascore": "83",
    "userscore": "7.1",
    "link": "https://www.metacritic.com/movie/saint-maud"
  },
  {
    "rank": "16.",
    "title": "Sator",
    "release_date": "February 9, 2021",
    "summary": "Secluded in a desolate forest home to little more than the decaying remnants of the past, a broken family is further torn apart by a mysterious death. Adam, guided by a pervasive sense of dread, hunts for answers only to learn that they are not alone; an insidious presence by the name of Sator has been observing his family, subtly influencing all of them for years in an attempt to claim them.",
    "metascore": "82",
    "userscore": "7.3",
    "link": "https://www.metacritic.com/movie/sator"
  },
  {
    "rank": "17.",
    "title": "Two of Us",
    "release_date": "February 5, 2021",
    "summary": "Two retired women, Nina and Madeleine, have been secretly in love for decades. Everybody, including Madeleine’s family, thinks they are simply neighbors, sharing the top floor of their building. They come and go between their two apartments, enjoying the affection and pleasures of daily life together, until an unforeseen event turns their relationship upside down and leads Madeleine’s daughter to gradually unravel the truth about them.",
    "metascore": "82",
    "userscore": "3.1",
    "link": "https://www.metacritic.com/movie/two-of-us"
  },
  {
    "rank": "18.",
    "title": "Acasă, My Home",
    "release_date": "January 15, 2021",
    "summary": "In the wilderness of the Bucharest Delta, an abandoned water reservoir just outside the bustling metropolis, the Enache family lived in perfect harmony with nature for two decades, sleeping in a hut on the lakeshore, catching fish barehanded, and following the rhythm of the seasons. When this area is transformed into a public national park, they are forced to leave behind their unconventional life and move to the city, where fishing rods are replaced by smartphones and idle afternoons are now spent in classrooms. As the family struggles to conform to modern civilization and maintain their connection to each other and themselves, they each begin to question their place in the world and what their future might be. With their roots in the wilderness, the nine children and their parents struggle to find a way to keep their family united in the concrete jungle.",
    "metascore": "82",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/acas-my-home"
  },
  {
    "rank": "19.",
    "title": "Derek DelGaudio’s In \u0026 Of Itself",
    "release_date": "January 22, 2021",
    "summary": "Storyteller and Conceptual Magician Derek DelGaudio attempts to understand the illusory nature of identity and answer the deceptively simple question 'Who am I?'",
    "metascore": "82",
    "userscore": "9.0",
    "link": "https://www.metacritic.com/movie/derek-delgaudios-in-of-itself"
  },
  {
    "rank": "20.",
    "title": "Test Pattern",
    "release_date": "February 19, 2021",
    "summary": "Test Pattern follows an interracial couple whose relationship is put to the test after a Black woman is sexually assaulted and her white boyfriend drives her from hospital to hospital in search of a rape kit. Their story reveals the systemic injustices and social conditioning women face when navigating sex and consent within the American patriarchy.",
    "metascore": "81",
    "userscore": "6.8",
    "link": "https://www.metacritic.com/movie/test-pattern"
  },
  {
    "rank": "21.",
    "title": "MLK/FBI",
    "release_date": "January 15, 2021",
    "summary": "Dr. Martin Luther King Jr. is remembered today as an American hero: a bridge-builder, a shrewd political tactician, and a moral leader. Yet throughout his history-altering political career, he was often treated by U.S. intelligence and law enforcement agencies like an enemy of the state. In this virtuosic documentary, award-winning editor and director Sam Pollard (Editor, 4 LITTLE GIRLS, MO’ BETTER BLUES; Director/Producer, EYEZ ON THE PRIZE, SAMMY DAVIS, JR.: I’VE GOTTA BE ME) lays out a detailed account of the FBI surveillance that dogged King’s activism throughout the ’50s and ’60s, fueled by the racist and red-baiting paranoia of J. Edgar Hoover. In crafting a rich archival tapestry, featuring some revelatory restored footage of King, Pollard urges us to remember that true American progress is always hard-won.",
    "metascore": "81",
    "userscore": "5.1",
    "link": "https://www.metacritic.com/movie/mlkfbi"
  },
  {
    "rank": "22.",
    "title": "The Road to Mandalay",
    "release_date": "January 12, 2021",
    "summary": "Two Burmese immigrants flee their country's civil war in search of a new life in Thailand. Finding work, they focus their efforts on acquiring Thai ID cards. However, when one achieves this goal, their relationship is doomed.",
    "metascore": "80",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-road-to-mandalay"
  },
  {
    "rank": "23.",
    "title": "Shiva Baby",
    "release_date": "April 2, 2021",
    "summary": "At a Jewish funeral service with her parents, a college student runs into her sugar daddy.",
    "metascore": "79",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/shiva-baby"
  },
  {
    "rank": "24.",
    "title": "Beginning",
    "release_date": "January 29, 2021",
    "summary": "In a sleepy provincial town, a Jehovah Witness community is attacked by an extremist group. In the midst of this conflict, the familiar world of Yana, the wife of the community leader, slowly crumbles. Yana's inner discontent grows as she struggles to make sense of her desires.",
    "metascore": "78",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/beginning"
  },
  {
    "rank": "25.",
    "title": "My Little Sister",
    "release_date": "January 15, 2021",
    "summary": "Lisa, once a brilliant playwright, no longer writes. She lives with her family in Switzerland, but her heart remains in Berlin, beating in time with that of her twin brother Sven, the famous theatre actor. Since Sven has been suffering from an aggressive type of leukaemia, the relationship between them has become even closer. Lisa does not want to accept this blow of fate, she does everything in her power to bring Sven back on stage. For her soulmate she neglects everything else and even risks losing her husband. Her marriage goes awry, but Lisa only has eyes for her brother, who reflects her deepest longings and awakens in her the desire to be creative, to feel alive again.",
    "metascore": "78",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/my-little-sister"
  },
  {
    "rank": "26.",
    "title": "The White Tiger",
    "release_date": "January 13, 2021",
    "summary": "Balram Halwai (Adarsh Gourav) narrates his epic and darkly humorous rise from poor villager to successful entrepreneur in modern India. Cunning and ambitious, our young hero jockeys his way into becoming a driver for Ashok (Rajkummar Rao) and Pinky (Priyanka Chopra Jonas), who have just returned from America. Society has trained Balram to be one thing — a servant — so he makes himself indispensable to his rich masters. But after a night of betrayal, he realizes the corrupt lengths they will go to trap him and save themselves. On the verge of losing everything, Balram rebels against a rigged and unequal system to rise up and become a new kind of master. Based on the New York Times bestseller and 2008 Man Booker Prize-winning novel.",
    "metascore": "76",
    "userscore": "7.2",
    "link": "https://www.metacritic.com/movie/the-white-tiger"
  },
  {
    "rank": "27.",
    "title": "Raya and the Last Dragon",
    "release_date": "March 5, 2021",
    "summary": "Long ago, in the fantasy world of Kumandra, humans and dragons lived together in harmony. But when an evil force threatened the land, the dragons sacrificed themselves to save humanity. Now, 500 years later, that same evil has returned and it’s up to a lone warrior, Raya, to track down the legendary last dragon to restore the fractured land and its divided people. However, along her journey, she’ll learn that it’ll take more than a dragon to save the world—it’s going to take trust and teamwork as well.",
    "metascore": "75",
    "userscore": "7.3",
    "link": "https://www.metacritic.com/movie/raya-and-the-last-dragon"
  },
  {
    "rank": "28.",
    "title": "Notturno",
    "release_date": "January 22, 2021",
    "summary": "Filmed over three years on the borders between Iraq, Kurdistan, Syria and Lebanon, Notturno captures  the  everyday  life  that  lies  behind  the  continuing  tragedy  of  civil  wars,  ferocious dictatorships, foreign invasions and the murderous apocalypse of ISIS.",
    "metascore": "74",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/notturno"
  },
  {
    "rank": "29.",
    "title": "Some Kind of Heaven",
    "release_date": "January 15, 2021",
    "summary": "Behind the gates of a palm tree-lined fantasyland, four residents of America's largest retirement community, The Villages, FL, strive to find solace and meaning.",
    "metascore": "74",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/some-kind-of-heaven"
  },
  {
    "rank": "30.",
    "title": "The World to Come",
    "release_date": "February 12, 2021",
    "summary": "In upstate New York in the 1850s, Abigail (Katherine Waterston), a farmer’s wife, and her new neighbor Tallie (Vanessa Kirby) find themselves irrevocably drawn to each other. A grieving Abigail tends to her withdrawn husband Dyer (Casey Affleck) as free-spirit Tallie bristles at the jealous control of her husband Finney (Christopher Abbott), when together their intimacy begins to fill a void in each other's lives they never knew existed.",
    "metascore": "73",
    "userscore": "5.0",
    "link": "https://www.metacritic.com/movie/the-world-to-come"
  },
  {
    "rank": "31.",
    "title": "Supernova",
    "release_date": "January 29, 2021",
    "summary": "Sam (Colin Firth) and Tusker (Stanley Tucci), partners of twenty years, are traveling across England in their old camper van visiting friends, family and places from their past. Following a life-changing diagnosis, their time together has become more important than ever until secret plans test their love like never before.",
    "metascore": "73",
    "userscore": "7.6",
    "link": "https://www.metacritic.com/movie/supernova-2020"
  },
  {
    "rank": "32.",
    "title": "Dead Pigs",
    "release_date": "February 12, 2021",
    "summary": "A bumbling pig farmer, a feisty salon owner, a sensitive busboy, an ambitious expat architect and a disenchanted rich girl converge and collide as thousands of dead pigs float down the river towards a rapidly modernizing Shanghai, China. Based on true events.",
    "metascore": "73",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/dead-pigs"
  },
  {
    "rank": "33.",
    "title": "Sophie Jones",
    "release_date": "March 2, 2021",
    "summary": "Stunned by the untimely death of her mother and struggling with the myriad challenges of teendom, Sophie (Jessica Barr) tries everything she can to feel something again, while holding herself together.",
    "metascore": "73",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/sophie-jones"
  },
  {
    "rank": "34.",
    "title": "The Dig",
    "release_date": "January 15, 2021",
    "summary": "As WWII looms, a wealthy widow (Carey Mulligan) hires an amateur archaeologist (Ralph Fiennes) to excavate the burial mounds on her estate. When they make a historic discovery, the echoes of Britain's past resonate in the face of its uncertain future‎. [Netflix]",
    "metascore": "73",
    "userscore": "6.6",
    "link": "https://www.metacritic.com/movie/the-dig"
  },
  {
    "rank": "35.",
    "title": "My Rembrandt",
    "release_date": "January 6, 2021",
    "summary": "My Rembrandt is set in the world of the Old Masters and offers a mosaic of gripping stories in which unrestrained passion for Rembrandt’s paintings leads to dramatic developments and unexpected plot turns.",
    "metascore": "72",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/my-rembrandt"
  },
  {
    "rank": "36.",
    "title": "Zola",
    "release_date": "June 30, 2021",
    "summary": "A stripper named Zola embarks on a wild road trip to Florida.",
    "metascore": "72",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/zola"
  },
  {
    "rank": "37.",
    "title": "Billie Eilish: The World's a Little Blurry",
    "release_date": "February 26, 2021",
    "summary": "Billie Eilish: The World’s A Little Blurry tells the true coming-of-age story of the singer-songwriter and her rise to global superstardom. From award-winning filmmaker R.J. Cutler, the documentary offers a deeply intimate look at this extraordinary teenager’s journey, at just seventeen years old, navigating life on the road, on stage, and at home with her family, while writing, recording and releasing her debut album \"When We All Fall Asleep, Where Do We Go?\".",
    "metascore": "72",
    "userscore": "8.1",
    "link": "https://www.metacritic.com/movie/billie-eilish-the-worlds-a-little-blurry"
  },
  {
    "rank": "38.",
    "title": "Twilight's Kiss",
    "release_date": "February 10, 2021",
    "summary": "Twilight's Kiss (Suk Suk) presents the story of two closeted married men in their twilight years. One day Pak, 70, a taxi driver who refuses to retire, meets Hoi, 65, a retired single father, in a park. Despite years of societal and personal pressure, they are proud of the families they have created through hard work and determination. Yet in that brief initial encounter, something is unleashed in them which had been suppressed for so many years. As both men recount and recall their personal histories, they also contemplate a possible future together. [Strand Releasing]",
    "metascore": "71",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/twilights-kiss"
  },
  {
    "rank": "39.",
    "title": "Little Fish",
    "release_date": "February 5, 2021",
    "summary": "Little Fish opens in the midst of a global epidemic: Neuroinflammatory Affliction, a sever and rapid Alzheimer’s-like condition in which people’s memories disappear. Couple Jude Williams (Jack O’Connell) and Emma Ryerson (Olivia Cooke) are grappling with the realities of NIA, interspersed with glimpses from the past as the two meet and their relationship blooms. But as NIA’s grip on society tightens, blurring the lines between the past and the present,  it becomes more and more difficult to know what’s true and what’s false.",
    "metascore": "71",
    "userscore": "7.3",
    "link": "https://www.metacritic.com/movie/little-fish-2021"
  },
  {
    "rank": "40.",
    "title": "Preparations to be Together for an Unknown Period of Time",
    "release_date": "January 22, 2021",
    "summary": "After 20 years in the United States, Márta, a Hungarian neurosurgeon, returns to Budapest for a romantic rendezvous with a fellow doctor she met at a conference. When the love of her life is nowhere to be seen, she tracks him down only to have the bewildered man claim the two have never met.",
    "metascore": "70",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/preparations-to-be-together-for-an-unknown-period-of-time"
  },
  {
    "rank": "41.",
    "title": "The Vigil",
    "release_date": "February 26, 2021",
    "summary": "Steeped in ancient Jewish lore and demonology, The Vigil is supernatural horror film set over the course of a single evening in Brooklyn's Hasidic Borough Park neighborhood. Low on funds and having recently left his insular religious community, Yakov reluctantly accepts an offer from his former rabbi and confidante to take on the responsibility of an overnight \"shomer,\" fulfilling the Jewish practice of watching over the body of a deceased community member. Shortly after arriving at the recently departed's dilapidated house to sit the vigil, Yakov begins to realize that something is very, very wrong.",
    "metascore": "69",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-vigil"
  },
  {
    "rank": "42.",
    "title": "Finding 'Ohana",
    "release_date": "January 29, 2021",
    "summary": "A summer in rural O‘ahu takes an exciting turn for two Brooklyn-raised siblings (Kea Peahu and Alex Aiono) when a journal pointing to long-lost treasure sets them on an epic adventure with new friends, and leads them to reconnect with their Hawaiian heritage.",
    "metascore": "69",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/finding-ohana"
  },
  {
    "rank": "43.",
    "title": "PG: Psycho Goreman",
    "release_date": "January 22, 2021",
    "summary": "Siblings Mimi and Luke unwittingly resurrect an ancient alien overlord who was entombed on Earth millions of years ago after a failed attempt to destroy the universe. They nickname the evil creature Psycho Goreman (or PG for short) and use the magical amulet they discovered to force him to obey their childish whims. It isn’t long before PG’s reappearance draws the attention of intergalactic friends and foes from across the cosmos and a rogues’ gallery of alien combatants converges in small-town suburbia to battle for the fate of the galaxy.",
    "metascore": "69",
    "userscore": "7.1",
    "link": "https://www.metacritic.com/movie/pg-psycho-goreman"
  },
  {
    "rank": "44.",
    "title": "The Night",
    "release_date": "January 29, 2021",
    "summary": "After a night out with friends, an exhausted married couple, Babak (Shahab Hosseini), Neda (Niousha Noor) and their baby take shelter in the grand, but eerie Hotel Normandie. Throughout a seemingly endless night, mysterious disturbances ruin their night’s rest as Babak and Neda soon realize they’re locked-in with a malevolent force that hungers for the dark secrets they’ve kept from one another.",
    "metascore": "68",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-night"
  },
  {
    "rank": "45.",
    "title": "Spoor",
    "release_date": "January 22, 2021",
    "summary": "Retired civil engineer Duszejko lives a secluded life in a mountain village close to the border between Poland and the Czech Republic. She is charismatic and eccentric, a passionate astrologer and a strict vegetarian. One day her beloved dogs disappear. On a snowy winter’s night shortly afterwards she discovers the dead body of her neighbour and, next to it, deer tracks. More men die in a similarly mysterious way. All of them were pillars of the village community, and all were passionate hunters. Were these men killed by wild animals? Or has someone been provoked to pursue a bloody vendetta? At some point Duszejko herself comes under suspicion.",
    "metascore": "67",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/spoor"
  },
  {
    "rank": "46.",
    "title": "The Wanting Mare",
    "release_date": "February 5, 2021",
    "summary": "In Whithren, a line of women pass a recurring dream through multiple generations.",
    "metascore": "67",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-wanting-mare"
  },
  {
    "rank": "47.",
    "title": "Shadow in the Cloud",
    "release_date": "January 1, 2021",
    "summary": "In the throes of World War II, Captain Maude Garrett (Chloë Grace Moretz) joins the all-male crew of a B-17 bomber with a top-secret package. Caught off guard by the presence of a woman on a military flight, the crew tests Maude’s every move. Just as her quick wit is winning them over, strange happenings and holes in her backstory incite paranoia surrounding her true mission. But this crew has more to fear…lurking in the shadows, something sinister is tearing at the heart of the plane. Trapped between an oncoming air ambush and an evil lurking within, Maude must push beyond her limits to save the hapless crew and protect her mysterious cargo.",
    "metascore": "66",
    "userscore": "3.4",
    "link": "https://www.metacritic.com/movie/shadow-in-the-cloud"
  },
  {
    "rank": "48.",
    "title": "I Care a Lot",
    "release_date": "February 19, 2021",
    "summary": "Poised with sharklike self-assurance, Marla Grayson (Rosamund Pike) is a professional, court-appointed guardian for dozens of elderly wards whose assets she seizes and cunningly bilks through dubious but legal means. It’s a well-oiled racket that  Marla and her business-partner and lover Fran (Eiza González) use with brutal efficiency on their latest “cherry,” Jennifer Peterson (Dianne Wiest) — a wealthy retiree with no living heirs or family. But when their mark turns out to have an equally shady secret of her own and connections to a volatile gangster (Peter Dinklage), Marla is forced to level up in a game only predators can play — one that’s neither fair, nor square. [Netflix]",
    "metascore": "66",
    "userscore": "2.9",
    "link": "https://www.metacritic.com/movie/i-care-a-lot"
  },
  {
    "rank": "49.",
    "title": "To All the Boys: Always and Forever",
    "release_date": "February 12, 2021",
    "summary": "As Lara Jean Covey prepares for the end of high school and the start of adulthood, a pair of life-changing trips lead her to re-imagine what life with her family, friends, and Peter will look like after graduation. (Netflix)",
    "metascore": "65",
    "userscore": "5.9",
    "link": "https://www.metacritic.com/movie/to-all-the-boys-always-and-forever"
  },
  {
    "rank": "50.",
    "title": "True Mothers",
    "release_date": "January 29, 2021",
    "summary": "After a long and unsuccessful struggle to get pregnant, Satoko and her husband decide to adopt a child. Over the next six years, the middle-class couple and their young son Asato settle into a comfortable, albeit routine, life. The family’s orderly existence is shattered by the arrival of Hikari, a young woman claiming to be Asato’s biological mother, demanding his return. As tensions mount, Satoko grows more and more emboldened to defend her family.",
    "metascore": "65",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/true-mothers"
  },
  {
    "rank": "51.",
    "title": "Sin",
    "release_date": "February 19, 2021",
    "summary": "Florence, early XVI century. Although widely considered a genius by his contemporaries, Michelangelo Buonarroti (Alberto Testone) is reduced to poverty and depleted by his struggle to finish the ceiling of the Sistine Chapel. When his commissioner and head of the Della Rovere nobility Pope Julius II dies, Michelangelo becomes obsessed with sourcing the finest marble to complete his tomb. The artist’s loyalty is tested when Leo X, of the rival Medici family, ascends to the papacy and charges him with a lucrative new commission – the façade of the San Lorenzo basilica. Forced to lie to maintain favor with both families, Michelangelo is progressively tormented by suspicion and hallucinations, leading him to ruthlessly examine his own moral and artistic failings. [Corinth Films]",
    "metascore": "65",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/sin"
  },
  {
    "rank": "52.",
    "title": "Barb \u0026 Star Go to Vista Del Mar",
    "release_date": "February 12, 2021",
    "summary": "Lifelong friends Barb and Star (Kristen Wiig and Annie Mumolo) embark on the adventure of a lifetime when they decide to leave their small Midwestern town for the first time … ever. [Lionsgate]",
    "metascore": "64",
    "userscore": "7.2",
    "link": "https://www.metacritic.com/movie/barb-and-star-go-to-vista-del-mar"
  },
  {
    "rank": "53.",
    "title": "The SpongeBob Movie: Sponge on the Run",
    "release_date": "March 4, 2021",
    "summary": "After SpongeBob’s beloved pet snail Gary is snail-napped, he and Patrick embark on an epic adventure to The Lost City of Atlantic City to bring Gary home. As they navigate the delights and dangers on this perilous and hilarious rescue mission, SpongeBob and his pals prove there’s nothing stronger than the power of friendship.",
    "metascore": "63",
    "userscore": "7.1",
    "link": "https://www.metacritic.com/movie/the-spongebob-movie-sponge-on-the-run"
  },
  {
    "rank": "54.",
    "title": "Falling",
    "release_date": "February 5, 2021",
    "summary": "John (Viggo Mortensen) lives with his partner, Eric (Terry Chen), and their daughter, Monica (Gabby Velis), in California, far from the traditional rural life he left behind years ago. His father, Willis (Lance Henriksen), a headstrong man from a bygone era, lives alone on the isolated farm where John grew up. Willis’s mind is declining, so John brings him west, hoping he and his sister, Sarah (Laura Linney), can help their father find a home closer to them. Their best intentions ultimately run up against Willis’s angry refusal to change his way of life in any way.",
    "metascore": "63",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/falling-2020"
  },
  {
    "rank": "55.",
    "title": "Blizzard of Souls",
    "release_date": "January 8, 2021",
    "summary": "Blizzard of Souls pays stark witness to the horrors and brutality of the First World War, as seen through the eyes of an innocent 17-year-old farm-boy turned soldier. Though he is underage, and his dad, a former marksman, is overage for the army, they are both conscripted into one of Latvia’s first national battalions. The thrill of training is soon followed by reality, as shells burst around them in the endless mud. He grows up on the battlefield, fighting at the side of his father and brother, their lives are constantly in jeopardy. [Film Movement]",
    "metascore": "63",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/blizzard-of-souls"
  },
  {
    "rank": "56.",
    "title": "A Glitch in the Matrix",
    "release_date": "February 5, 2021",
    "summary": "What if we are living in a simulation, and the world as we know it is not real? To tackle this mind-bending idea, acclaimed filmmaker Rodney Ascher (ROOM 237, THE NIGHTMARE) uses a noted speech from Philip K. Dick to dive down the rabbit hole of science, philosophy, and conspiracy theory. Leaving no stone unturned in exploring the unprovable, the film uses contemporary cultural touchstones like THE MATRIX, interviews with real people shrouded in digital avatars, and a wide array of voices, expert and amateur alike. If simulation theory is not science fiction but fact, and life is a video game being played by some unknowable entity, then who are we, really? A GLITCH IN THE MATRIX attempts to find out.",
    "metascore": "63",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/a-glitch-in-the-matrix"
  },
  {
    "rank": "57.",
    "title": "The Salt of Tears",
    "release_date": "January 20, 2021",
    "summary": "Driven by his desire to become a cabinetmaker, Luc arrives in Paris. Lost in the banlieues, he asks Djemila for directions. In the girl's shyness, Luc glimpses the chance of an adventure. The two meet again but then Luc has to return home to his father, who is also a carpenter. There, he meets Geneviève, whom he knows from the past, and begins a romance with her. When Luc is offered a place at the renowned furniture-making school École Boulle, he follows his dream and moves to Paris, leaving Geneviève behind. Soon, a third young woman enters his small apartment, bringing the freedom of the big city with her.",
    "metascore": "62",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-salt-of-tears"
  },
  {
    "rank": "58.",
    "title": "Land",
    "release_date": "February 12, 2021",
    "summary": "Edee (Robin Wright), in the aftermath of an unfathomable event, finds herself unable to stay connected to the world she once knew and in the face of that uncertainty, retreats to the magnificent, but unforgiving, wilds of the Rockies. After a local hunter (Demián Bichir) brings her back from the brink of death, she must find a way to live again.",
    "metascore": "62",
    "userscore": "5.8",
    "link": "https://www.metacritic.com/movie/land"
  },
  {
    "rank": "59.",
    "title": "The Night House",
    "release_date": "July 16, 2021",
    "summary": "A widow begins to uncover her recently deceased husband's disturbing secrets.",
    "metascore": "62",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-night-house"
  },
  {
    "rank": "60.",
    "title": "Flora \u0026 Ulysses",
    "release_date": "February 19, 2021",
    "summary": "10-year-old Flora is an avid comic book fan and a self-avowed cynic, whose parents have recently separated. After rescuing a squirrel she names Ulysses, Flora is amazed to discover he possesses unique superhero powers, which take them on an adventure of humorous complications that ultimately change Flora's life--and her outlook--forever.  Based on the Newbery Award-winning book.",
    "metascore": "62",
    "userscore": "5.8",
    "link": "https://www.metacritic.com/movie/flora-ulysses"
  },
  {
    "rank": "61.",
    "title": "Biggie: I Got a Story to Tell",
    "release_date": "March 1, 2021",
    "summary": "In the wake of the Notorious B.I.G.’s landmark induction into the Rock and Roll Hall of Fame, and ahead of what would have been his 50th birthday, Biggie: I Got A Story To Tell offers a fresh look at one of the greatest, most influential rappers of all time by those who knew him best. Made in collaboration with Biggie’s estate, I Got A Story To Tell is an intimate rendering of a man whose rapid ascent and tragic end has been at the center of rap lore for more than twenty years. [Netlfix]",
    "metascore": "62",
    "userscore": "5.5",
    "link": "https://www.metacritic.com/movie/biggie-i-got-a-story-to-tell"
  },
  {
    "rank": "62.",
    "title": "Rams",
    "release_date": "February 5, 2021",
    "summary": "In remote Western Australia, two estranged brothers, Colin (Sam Neill) and Les (Michael Caton), are at war. Raising separate flocks of sheep descended from their family’s prized bloodline, the two men work side by side yet are worlds apart. When Les’s prize ram is diagnosed with a rare and lethal illness, authorities order a purge of every sheep in the valley. While Colin attempts to stealthily outwit the powers that be, Les opts for angry defiance. But can the warring brothers set aside their differences and have a chance to reunite their family, save their herd, and bring their community back together?",
    "metascore": "62",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/rams-2020"
  },
  {
    "rank": "63.",
    "title": "The Courier",
    "release_date": "March 19, 2021",
    "summary": "The Courier is the true story of an unassuming British businessman Greville Wynne (Cumberbatch) recruited into one of the greatest international conflicts in history. At the behest of the UK's MI-6 and a CIA operative (Rachel Brosnahan), he forms a covert, dangerous partnership with Soviet officer Oleg Penkovsky (Merab Ninidze) in an effort to provide crucial intelligence needed to prevent a nuclear confrontation  and defuse the Cuban Missile Crisis.",
    "metascore": "62",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-courier-2020"
  },
  {
    "rank": "64.",
    "title": "PVT Chat",
    "release_date": "February 5, 2021",
    "summary": "Jack is a lonely internet gambler living in New York City. He quickly becomes fixated on Scarlet - a cam girl from San Francisco. As Jack learns more about Scarlet, he discovers her unrealized talent as a painter and begins to fall hard for her. His obsession reaches a boiling point when fantasy materializes in reality and Jack sees Scarlet on a rainy street in NYC Chinatown. While Scarlet is clearly hiding her whole truth, milking Jack’s wallet in the process, she also seems to develop genuine feelings for him. Jack has to find out - is their emotional connection real or is he just being taken for a ride?",
    "metascore": "61",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/pvt-chat"
  },
  {
    "rank": "65.",
    "title": "The Map of Tiny Perfect Things",
    "release_date": "February 12, 2021",
    "summary": "Quick-witted teen Mark contentedly lives the same day in an endless loop. But his world is turned upside-down when he meets mysterious Margaret also stuck in the time loop. Mark and Margaret form a magnetic partnership, setting out to find all the tiny things that make that one day perfect. What follows is a love story with a fantastical twist, as the two struggle to figure out how – and whether – to escape their never-ending day.",
    "metascore": "61",
    "userscore": "7.3",
    "link": "https://www.metacritic.com/movie/the-map-of-tiny-perfect-things"
  },
  {
    "rank": "66.",
    "title": "French Exit",
    "release_date": "February 12, 2021",
    "summary": "My plan was to die before the money ran out,” says 60-year-old penniless Manhattan socialite Frances Price (Michelle Pfeiffer), but things didn’t go as planned. Her husband Franklin has been dead for 12 years and with his vast inheritance gone, she cashes in the last of her possessions and resolves to live out her twilight days anonymously in a borrowed apartment in Paris, accompanied by her directionless son Malcolm (Lucas Hedges) and a cat named Small Frank—who may or may not embody the spirit of Frances’s dead husband.",
    "metascore": "59",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/french-exit"
  },
  {
    "rank": "67.",
    "title": "My Zoe",
    "release_date": "February 26, 2021",
    "summary": "Recently divorced scientist Isabelle (Julie Delpy) struggles to co-parent her daughter Zoe with her argumentative ex. But when Zoe suffers an unexpected brain hemorrhage and is put on life support, Isabelle comes up with an audacious plan to keep some version of her daughter alive.",
    "metascore": "59",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/my-zoe"
  },
  {
    "rank": "68.",
    "title": "Jumbo",
    "release_date": "February 19, 2021",
    "summary": "Jeanne (Noémie Merlant), a shy young woman, works in an amusement park. She still lives at home with her mother and is fascinated with lights and carousels. When Jeanne meets Jumbo, the park's new flagship attraction, a thrilling and unique romance ensues.",
    "metascore": "58",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/jumbo"
  },
  {
    "rank": "69.",
    "title": "Our Friend",
    "release_date": "January 22, 2021",
    "summary": "[Formerly known as \"The Friend.\"] After learning that his terminally ill wife has six months to live, a man welcomes the support of his best friend who moves into their home to help out. His impact on the whole family is much greater than anyone could have imagined.",
    "metascore": "57",
    "userscore": "6.4",
    "link": "https://www.metacritic.com/movie/our-friend"
  },
  {
    "rank": "70.",
    "title": "Days of the Bagnold Summer",
    "release_date": "February 19, 2021",
    "summary": "A teenager spends his summer listening to heavy metal music and trying to get along with his librarian mom.",
    "metascore": "57",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/days-of-the-bagnold-summer"
  },
  {
    "rank": "71.",
    "title": "Moxie",
    "release_date": "March 3, 2021",
    "summary": "Fed up with the sexist and toxic status quo at her high school, a shy 16-year-old finds inspiration from her mother's rebellious past and anonymously publishes a zine that sparks a school-wide, coming-of-rage revolution.",
    "metascore": "55",
    "userscore": "5.5",
    "link": "https://www.metacritic.com/movie/moxie"
  },
  {
    "rank": "72.",
    "title": "Boss Level",
    "release_date": "March 5, 2021",
    "summary": "A retired special forces officer is trapped in a never ending time loop on the day of his death.",
    "metascore": "55",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/boss-level"
  },
  {
    "rank": "73.",
    "title": "The Little Things",
    "release_date": "January 29, 2021",
    "summary": "Kern County Deputy Sheriff Joe “Deke” Deacon (Denzel Washington) is sent to Los Angeles for what should have been a quick evidence-gathering assignment. Instead, he becomes embroiled in the search for a killer who is terrorizing the city. Leading the hunt, L.A. Sheriff Department Sergeant Jim Baxter (Rami Malek), impressed with Deke’s cop instincts, unofficially engages his help. But as they track the killer, Baxter is unaware that the investigation is dredging up echoes of Deke’s past, uncovering disturbing secrets that could threaten more than his case.",
    "metascore": "54",
    "userscore": "5.7",
    "link": "https://www.metacritic.com/movie/the-little-things"
  },
  {
    "rank": "74.",
    "title": "Boogie",
    "release_date": "March 5, 2021",
    "summary": "Alfred “Boogie” Chin is a basketball phenom living in Queens, New York, who dreams of one day playing in the NBA. While his parents pressure him to focus on earning a scholarship to an elite college, Boogie must find a way to navigate a new girlfriend, high school, on-court rivals and the burden of expectation.",
    "metascore": "54",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/boogie"
  },
  {
    "rank": "75.",
    "title": "Life in a Day 2020",
    "release_date": "February 6, 2021",
    "summary": "On July 25th, 2020, people all over the world filmed their lives and shared their stories to be part of a documentary film. When all the submissions were tallied, the filmmakers had received over 300,000 videos from 192 countries.  The result is a film about love, death, heartbreak, and hope that looks beyond geography and circumstance to explore what connects us as humans.",
    "metascore": "54",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/life-in-a-day-2020"
  },
  {
    "rank": "76.",
    "title": "Penguin Bloom",
    "release_date": "January 27, 2021",
    "summary": "In 2013, Samantha Bloom (Naomi Watts), her husband Cameron (Andrew Lincoln) and their three sons left their home in Australia for a holiday in Thailand. While enjoying a view, Sam fell off of a rooftop due to what was later determined to be a rotted railing...breaking her vertebrae in two places.  Paralyzed from the chest down, Sam — a lifelong outdoorswoman, surfer, and traveler —was unrecognizable to herself, and spent long months in a depression that made her question who she could be in the world and in her own family.  A year later, her children brought home a wounded baby magpie they found. Warily eyeing the black-and-white bird the kids affectionately named “Penguin,” Sam bonded with the household’s new member, beginning a process of emotional healing that surprised her husband and sons, her mother (Jacki Weaver), and herself.",
    "metascore": "54",
    "userscore": "7.0",
    "link": "https://www.metacritic.com/movie/penguin-bloom"
  },
  {
    "rank": "77.",
    "title": "The Mauritanian",
    "release_date": "February 12, 2021",
    "summary": "Captured by the U.S. Government, Mohamedou Ould Slahi (Tahar Rahim) languishes in prison for years without charge or trial. Losing all hope, Slahi finds allies in defense attorney Nancy Hollander (Jodie Foster) and her associate Teri Duncan (Shailene Woodley). Together they face countless obstacles in a desperate pursuit for justice. Their controversial advocacy, along with evidence uncovered by formidable military prosecutor, Lt. Colonel Stuart Couch (Benedict Cumberbatch), eventually reveals a shocking and far reaching conspiracy. Based on the New York Times best-selling memoir, this is the explosive true story of a fight for survival against all odds.",
    "metascore": "54",
    "userscore": "8.1",
    "link": "https://www.metacritic.com/movie/the-mauritanian"
  },
  {
    "rank": "78.",
    "title": "Palmer",
    "release_date": "January 29, 2021",
    "summary": "An ex-convict strikes up a friendship with a boy from a troubled home.",
    "metascore": "53",
    "userscore": "7.2",
    "link": "https://www.metacritic.com/movie/palmer"
  },
  {
    "rank": "79.",
    "title": "Malcolm \u0026 Marie",
    "release_date": "February 5, 2021",
    "summary": "A filmmaker (John David Washington) returns home with his girlfriend (Zendaya) following a celebratory movie premiere as he awaits what’s sure to be imminent critical and financial success. The evening suddenly takes a turn as revelations about their relationships begin to surface, testing the strength of their love.",
    "metascore": "53",
    "userscore": "6.1",
    "link": "https://www.metacritic.com/movie/malcolm-marie"
  },
  {
    "rank": "80.",
    "title": "The United States vs. Billie Holiday",
    "release_date": "February 26, 2021",
    "summary": "A drama that follows legendary jazz singer Billie Holiday during her career as she is targeted by the Federal Department of Narcotics with an undercover sting operation led by Black federal agent Jimmy Fletcher, with whom she had a tumultuous affair.",
    "metascore": "52",
    "userscore": "6.1",
    "link": "https://www.metacritic.com/movie/the-united-states-vs-billie-holiday"
  },
  {
    "rank": "81.",
    "title": "Coming 2 America",
    "release_date": "March 5, 2021",
    "summary": "Set in the lush and royal country of Zamunda, newly-crowned King Akeem (Eddie Murphy) and his trusted confidante Semmi(Arsenio Hall) embark on an all-new hilarious adventure that has them traversing the globe from their great African nation to the borough of Queens, New York – where it all began.",
    "metascore": "52",
    "userscore": "4.8",
    "link": "https://www.metacritic.com/movie/coming-2-america"
  },
  {
    "rank": "82.",
    "title": "No Man's Land",
    "release_date": "January 22, 2021",
    "summary": "Border vigilante Bill Greer (Frank Grillo) and his son Jackson (Jake Allyn) are on patrol when Jackson accidentally kills a Mexican immigrant boy. Bill tries to take the blame but Texas Ranger Ramirez (George Lopez) sees through the lie, spurring Jackson to flee south on horseback across the Rio Grande to become a gringo \"illegal alien\" in Mexico. Chased by Texas Rangers and Mexican federales, Jackson journeys across deserts and mountains to seek forgiveness from the dead boy's vengeful father (Jorge A. Jimenez), as he falls in love with the land he was taught to hate.",
    "metascore": "52",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/no-mans-land-2021"
  },
  {
    "rank": "83.",
    "title": "Bloody Hell",
    "release_date": "January 14, 2021",
    "summary": "When a bank heist goes awry, Rex Coen spends eight years in prison. Upon release, he's now infamous in his hometown of Boise, Idaho. The unwanted attention forces Rex to flee the country, in search of a better life. But he lands in a new hell. Waking up drugged, beaten, and tied up... Rex turns to his personified Conscience, which he conjured up to help him cope with his horrific past. Together, they must race against time to free themselves from a twisted family hiding a dark secret.",
    "metascore": "52",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/bloody-hell"
  },
  {
    "rank": "84.",
    "title": "Minamata",
    "release_date": "February 5, 2021",
    "summary": "War photographer W. Eugene Smith travels back to Japan where he documents the devastating effect of mercury poisoning in coastal communities.",
    "metascore": "51",
    "userscore": "8.6",
    "link": "https://www.metacritic.com/movie/minamata"
  },
  {
    "rank": "85.",
    "title": "The Violent Heart",
    "release_date": "February 19, 2021",
    "summary": "Nine-year-old Daniel lives in a town outside of Nashville. Daniel sees his sister sneak out the door and follows to a dark, secluded spot in the woods, where she is killed. Fifteen years later, Daniel lives at home with his mom and teen brother Aaron. The killer has never been caught. Struggling to find his path in life, Daniel works at a local auto shop and dreams of enlisting in the Marines like his father. But he has a criminal record and would need a rarely granted waiver. Cassie is an 18-year-old who has had her fill of high school. An only child, she is particularly close to her father, an English teacher at her school. When Cassie takes her car in for an oil change and meets Daniel there’s instant chemistry. Devastated to discover her father may not be the man she thought he was, Cassie reaches out to Daniel and a tender romance blossoms. But when deeply buried secrets of their small town are revealed, violent events of the past threaten to tear the couple apart. [Gravitas Ventures]",
    "metascore": "49",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-violent-heart"
  },
  {
    "rank": "86.",
    "title": "My Salinger Year",
    "release_date": "March 5, 2021",
    "summary": "New York in the 90s: After leaving graduate school to pursue her dream of becoming a writer, Joanna (Margaret Qualley) gets hired as an assistant to Margaret (Sigourney Weaver), the stoic and old-fashioned literary agent of J. D. Salinger. Fluctuating between poverty and glamour, she spends her days in a plush, wood-panelled office – where dictaphones and typewriters still reign and agents doze off after three-martini lunches – and her nights in a sink-less Brooklyn apartment with her socialist boyfriend. Joanna’s main task is processing Salinger’s voluminous fan mail, but as she reads the heart-wrenching letters from around the world, she becomes reluctant to send the agency’s impersonal standard letter and impulsively begins personalizing the responses. The results are both humorous and moving, as Joanna, while using the great writer’s voice, begins to discover her own. [IFC Films]",
    "metascore": "49",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/my-salinger-year"
  },
  {
    "rank": "87.",
    "title": "Hunted",
    "release_date": "January 14, 2021",
    "summary": "What started as a flirtatious encounter at a bar turns into a life-or-death struggle as Eve (Lucie Debay) becomes the unknowing target of a misogynistic plot against her. Forced to flee as two men pursue her through the forest, she’s pushed to her extremes while fighting to survive in the wilderness—but survival isn’t enough for Eve. She will have revenge.",
    "metascore": "47",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/hunted"
  },
  {
    "rank": "88.",
    "title": "Wrong Turn",
    "release_date": "January 26, 2021",
    "summary": "Jen (Charlotte Vega) and a group of friends set out to hike the Appalachian Trail. Despite warnings to stick to the trail, the hikers stray off course—and cross into land inhabited by The Foundation, a hidden community of mountain dwellers who use deadly means to protect their way of life. Suddenly under siege, Jen and her friends seem headed to the point of no return— unless Jen’s father (Matthew Modine) can reach them in time.",
    "metascore": "46",
    "userscore": "5.1",
    "link": "https://www.metacritic.com/movie/wrong-turn-2021"
  },
  {
    "rank": "89.",
    "title": "Cherry",
    "release_date": "February 26, 2021",
    "summary": "In an epic odyssey of romance, war, drug addiction, and crime, a young man (Tom Holland) struggles to find his place in the world.",
    "metascore": "46",
    "userscore": "6.6",
    "link": "https://www.metacritic.com/movie/cherry-2020"
  },
  {
    "rank": "90.",
    "title": "Earwig and the Witch",
    "release_date": "February 3, 2021",
    "summary": "Growing up in an orphanage in the British countryside, Earwig has no idea that her mother had magical powers. Her life changes dramatically when a strange couple takes her in, and she is forced to live with a selfish witch. As the headstrong young girl sets out to uncover the secrets of her new guardians, she discovers a world of spells and potions, and a mysterious song that may be the key to finding the family she has always wanted.",
    "metascore": "45",
    "userscore": "4.6",
    "link": "https://www.metacritic.com/movie/earwig-and-the-witch"
  },
  {
    "rank": "91.",
    "title": "Outside the Wire",
    "release_date": "January 15, 2021",
    "summary": "Set in the future, Harp (Damson Idris), a drone pilot, is sent into a deadly militarized zone where he finds himself working for Leo (Anthony Mackie), an android officer, tasked to locate a doomsday device before the insurgents do.",
    "metascore": "45",
    "userscore": "4.6",
    "link": "https://www.metacritic.com/movie/outside-the-wire"
  },
  {
    "rank": "92.",
    "title": "The Marksman",
    "release_date": "January 15, 2021",
    "summary": "Hardened Arizona rancher Jim Hanson (Liam Neeson) simply wants to be left alone as he fends off eviction notices and tries to make a living on an isolated stretch of borderland. But everything changes when Hanson, an ex-Marine sharpshooter, witnesses 11-year-old migrant Miguel (Jacob Perez) fleeing with his mother Rosa (Teresa Ruiz) from drug cartel assassins led by the ruthless Mauricio (Juan Pablo Raba). After being caught in a shoot-out, a dying Rosa begs Jim to take her son to safety to her family in Chicago. Defying her cop daughter Sarah (Katheryn Winnick), Jim sneaks Miguel out of the local U.S. Customs and Border Patrol station and together, they hit the road with the group of killers in pursuit. Jim and Miguel slowly begin to overcome their differences and begin to forge an unlikely friendship, while Mauricio and his fellow assassins blaze a cold-blooded trail, hot on their heels. When they finally meet on a Midwestern farm, a fight to the death ensues as Jim uses his military skills and code of honor to defend the boy he's come to love.",
    "metascore": "44",
    "userscore": "6.7",
    "link": "https://www.metacritic.com/movie/the-marksman"
  },
  {
    "rank": "93.",
    "title": "Locked Down",
    "release_date": "January 14, 2021",
    "summary": "Just as they decide to separate, Linda (Anne Hathaway) and Paxton (Chiwetel Ejiofor) find life has other plans when they are stuck at home in a mandatory lockdown. Co-habitation is proving to be a challenge, but fueled by poetry and copious amounts of wine, it will bring them closer together in the most surprising way.",
    "metascore": "44",
    "userscore": "5.2",
    "link": "https://www.metacritic.com/movie/locked-down"
  },
  {
    "rank": "94.",
    "title": "Crisis",
    "release_date": "February 26, 2021",
    "summary": "Three stories about the world of opioids collide: a drug trafficker arranges a multi-cartel Fentanyl smuggling operation between Canada and the U.S., an architect recovering from an OxyContin addiction tracks down the truth behind her son's involvement with narcotics, and a university professor battles unexpected revelations about his research employer, a drug company with deep government influence bringing a new \"non-addictive\" painkiller to market.",
    "metascore": "43",
    "userscore": "7.8",
    "link": "https://www.metacritic.com/movie/crisis"
  },
  {
    "rank": "95.",
    "title": "Willy's Wonderland",
    "release_date": "February 12, 2021",
    "summary": "A quiet loner (Nic Cage) finds himself stranded in a remote town when his car breaks down. Unable to pay for the repairs he needs, he agrees to spend the night cleaning Willy’s Wonderland, an abandoned family fun center. But this wonderland has a dark secret that “The Janitor” is about to discover. He soon finds himself trapped inside Willy's and locked in an epic battle with the possessed animatronic mascots that roam the halls. To survive, he must fight his way through each of them.",
    "metascore": "42",
    "userscore": "7.8",
    "link": "https://www.metacritic.com/movie/willys-wonderland"
  },
  {
    "rank": "96.",
    "title": "Silk Road",
    "release_date": "February 19, 2021",
    "summary": "Inspired by larger-than-life actual events, this riveting crime thriller follows the rise and fall of Silk Road, the infamous darknet site that sent a seismic shock through the World Wide Web. Young, idealistic, and driven to succeed, Ross Ulbricht (Nick Robinson) creates the internet’s first unregulated marketplace: Silk Road. But when it becomes a multimillion-dollar pipeline for illicit drugs, Ross is set on a collision course with Rick Bowden (Jason Clarke), a disreputable and dangerously unpredictable DEA agent, who will use any means necessary to take him down.",
    "metascore": "42",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/silk-road"
  },
  {
    "rank": "97.",
    "title": "Pixie",
    "release_date": "March 5, 2021",
    "summary": "Pixie (Olivia Cooke) wants to avenge her mother’s death by masterminding a heist, but her plans go awry and she finds herself on the run with two young men (Ben Hardy, Daryl McCormack) who are way out of their depth being chased across the Wild Irish countryside by... deadly gangster priests. She has to pit her wits against everyone, taking on the patriarchy to claim the right to shape her own life.",
    "metascore": "41",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/pixie"
  },
  {
    "rank": "98.",
    "title": "Brothers By Blood",
    "release_date": "January 22, 2021",
    "summary": "In the City of Brotherly Love, eight-year-old Peter Flood helplessly watches on as his little sister is killed by a neighbor’s reckless driving. Tormented with grief and resentment, his father finds revenge as the only solution, leaving lasting generational wounds. Thirty years later, Peter still wrestles with the guilt he feels over his sister’s death and his father’s vengeance. As he tries to distance himself from the criminal family business, his cousin, Michael, becomes more powerful in the hierarchy. Bonded by blood, neither man can escape violence as they are dragged further into a chilling cycle of betrayal and retribution.",
    "metascore": "41",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/brothers-by-blood"
  },
  {
    "rank": "99.",
    "title": "Chaos Walking",
    "release_date": "March 5, 2021",
    "summary": "In the not too distant future, Todd Hewitt (Tom Holland) discovers Viola (Daisy Ridley), a mysterious girl who crash lands on his planet, where all the women have disappeared and the men are afflicted by “the Noise” – a force that puts all their thoughts on display. In this dangerous landscape, Viola’s life is threatened – and as Todd vows to protect her, he will have to discover his own inner power and unlock the planet’s dark secrets.",
    "metascore": "40",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/chaos-walking"
  },
  {
    "rank": "100.",
    "title": "Bliss",
    "release_date": "February 5, 2021",
    "summary": "An unfulfilled man (Owen Wilson) and a mysterious woman (Salma Hayek) believe they are living in a simulated reality, but when their newfound ‘Bliss’ world begins to bleed into the ‘ugly’ world they must decide what’s real and where they truly belong.",
    "metascore": "40",
    "userscore": "6.4",
    "link": "https://www.metacritic.com/movie/bliss-2021"
  }
]