[
  {
    "rank": "1.",
    "title": "Mr. Bachmann and His Class",
    "release_date": "February 20, 2022",
    "summary": "In a German city with a complex history of both excluding and integrating foreigners, a charismatic elementary school teacher provides his pupils, who all come from different countries originally, with the key to feeling at home in Germany and becoming citizens of the world. [MUBI]",
    "metascore": "92",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/mr-bachmann-and-his-class"
  },
  {
    "rank": "2.",
    "title": "Hit the Road",
    "release_date": "April 22, 2022",
    "summary": "A family of four – two middle-aged parents and their sons, one a taciturn adult, the other an ebullient six-year-old – drive across the Iranian countryside. Over the course of the trip, they bond over memories of the past, grapple with fears of the unknown, and fuss over their sick dog.",
    "metascore": "91",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/hit-the-road"
  },
  {
    "rank": "3.",
    "title": "The Worst Person in the World",
    "release_date": "February 4, 2022",
    "summary": "Director Joachim Trier returns with another modern twist on a classically constructed character portrait of contemporary life in Oslo. Chronicling four years in the life of Julie, The Worst Person in the World examines one woman’s quest for love and meaning in the modern world. Fluidly told in twelve chapters, the film features a breakout performance by Cannes Best Actress winner Renate Reinsve as she explores new professional avenues and embarks on relationships with two very different men (Anders Danielsen Lie and Herbert Nordrum) in her search for happiness and identity. [Neon]",
    "metascore": "90",
    "userscore": "7.7",
    "link": "https://www.metacritic.com/movie/the-worst-person-in-the-world"
  },
  {
    "rank": "4.",
    "title": "Who We Are: A Chronicle of Racism in America",
    "release_date": "January 14, 2022",
    "summary": "Interweaving lecture, personal anecdotes, interviews, and shocking revelations, criminal defense/civil rights lawyer Jeffery Robinson draws a stark timeline of anti-Black racism in the United States, from slavery to the modern myth of a post-racial America.",
    "metascore": "89",
    "userscore": "3.8",
    "link": "https://www.metacritic.com/movie/who-we-are-a-chronicle-of-racism-in-america"
  },
  {
    "rank": "5.",
    "title": "Great Freedom",
    "release_date": "March 4, 2022",
    "summary": "In post-war Germany, liberation by the Allies does not mean freedom for everyone. Hans is imprisoned again and again under Paragraph 175, a law criminalizing homosexuality. Over the course of decades, he develops an unlikely yet tender bond with his cellmate Viktor, a convicted murderer.",
    "metascore": "89",
    "userscore": "6.4",
    "link": "https://www.metacritic.com/movie/great-freedom"
  },
  {
    "rank": "6.",
    "title": "RRR",
    "release_date": "March 25, 2022",
    "summary": "A fictitious story about two legendary revolutionaries and their journey away from home before they started fighting for their country in 1920's.",
    "metascore": "87",
    "userscore": "7.5",
    "link": "https://www.metacritic.com/movie/rrr"
  },
  {
    "rank": "7.",
    "title": "A Night of Knowing Nothing",
    "release_date": "February 11, 2022",
    "summary": "Through fictional love letters found in a cupboard at the Film and Television Institute of India, we meet L, a film student writing to her estranged lover while he is away. Gradually we’re immersed in the drastic changes taking place at the school and in the lives of young people across the country as they take to the streets to protest widespread discrimination.",
    "metascore": "87",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/a-night-of-knowing-nothing"
  },
  {
    "rank": "8.",
    "title": "In Front of Your Face",
    "release_date": "May 6, 2022",
    "summary": "After years living abroad, former actress Sangok (Lee Hyeyoung) is back in Seoul, staying with her sister Jeongok (Cho Yunhee) in her high-rise apartment. The siblings sleep late, have breakfast in a cafe and visit a restaurant owned by Jeongok's son. But as the details of Sangok's day accrue (a spill on her blouse, an encounter at her childhood home), it becomes clear that there is much she is not revealing. And these mysterious circumstances have something to do with her decision to meet with film director Jaewon (Kwon Haehyo) to discuss her return to acting.",
    "metascore": "87",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/in-front-of-your-face"
  },
  {
    "rank": "9.",
    "title": "Playground",
    "release_date": "February 11, 2022",
    "summary": "Following 7-year-old Nora and her big brother Abel, we see Nora struggling to fit in before finding her place on the schoolyard. One day, she notices Abel being bullied by other kids, and though she rushes to protect him by warning their father, Abel forces her to remain silent, while he endures more humiliation and harassment by his peers.",
    "metascore": "86",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/playground"
  },
  {
    "rank": "10.",
    "title": "Hold Your Fire",
    "release_date": "May 20, 2022",
    "summary": "Brooklyn, 1973. When Shu’aib Raheem tried to steal guns for self-defense, it sparked the longest hostage siege in NYPD history. NYPD psychologist Harvey Schlossberg fought to reform police use of violence and save lives by using words, not guns.",
    "metascore": "86",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/hold-your-fire"
  },
  {
    "rank": "11.",
    "title": "Happening",
    "release_date": "May 6, 2022",
    "summary": "France, 1963. Anne is a bright young student with a promising future ahead of her. But when she falls pregnant, she sees the opportunity to finish her studies and escape the constraints of her social background disappearing. With her final exams fast approaching and her belly growing, Anne resolves to act, even if she has to confront shame and pain, even if she must risk prison to do so.",
    "metascore": "86",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/happening"
  },
  {
    "rank": "12.",
    "title": "The Fallout",
    "release_date": "January 27, 2022",
    "summary": "Bolstered by new friendships forged under sudden and tragic circumstances, high schooler Vada (Jenna Ortega) begins to reinvent herself, while re-evaluating her relationships with her family, friends and her view of the world. Moving away from her comfortable family routine, she starts taking chances with a series of quicksilver decisions that test her own boundaries and push her in new directions. As she spends more time with Mia (Maddie Ziegler), they grow closer, and Vada slowly redefines herself through their shared experiences, leading her further away from that day and closer to living her life in the now.",
    "metascore": "84",
    "userscore": "7.0",
    "link": "https://www.metacritic.com/movie/the-fallout"
  },
  {
    "rank": "13.",
    "title": "Lingui, The Sacred Bonds",
    "release_date": "February 4, 2022",
    "summary": "On the outskirts of the capital of Chad, determined single mother Amina works tirelessly to provide for herself and her 15-year old daughter Maria. When Amina discovers Maria is pregnant and does not want a child, the two women begin to seek out an abortion, condemned by both religion and law.",
    "metascore": "83",
    "userscore": "6.5",
    "link": "https://www.metacritic.com/movie/lingui"
  },
  {
    "rank": "14.",
    "title": "The Girl and the Spider",
    "release_date": "April 8, 2022",
    "summary": "As her roommate Lisa prepares to move out of their apartment, Mara contemplates the end of an era. Furniture is moved, walls painted, cupboards built. Amid all the hustle and bustle, secret longings and desires come to the surface and coalesce around the roommates as well as around Lisa’s mother Astrid, the movers, the girls’ old neighbors, the neighbors’ cat, Lisa’s new neighbor and an ever-expanding cast of characters. Day turns into night and one final party in the apartment. When the last box is moved, the fragments of their lives remain.",
    "metascore": "83",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-girl-and-the-spider"
  },
  {
    "rank": "15.",
    "title": "Nitram",
    "release_date": "March 30, 2022",
    "summary": "Nitram (Caleb Landry Jones) lives with his mother (Judy Davis) and father (Anthony LaPaglia) in suburban Australia in the Mid 1990s. He lives a life of isolation and frustration at never being able to fit in. That is until he unexpectedly finds a close friend in a reclusive heiress, Helen (Essie Davis). However, when that relationship meets a tragic end, and Nitram’s loneliness and anger grow, he begins a slow descent that leads to disaster.",
    "metascore": "83",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/nitram"
  },
  {
    "rank": "16.",
    "title": "Turning Red",
    "release_date": "March 11, 2022",
    "summary": "Mei Lee (voice of Rosalie Chiang) is a confident, dorky 13-year-old torn between staying her mother’s dutiful daughter and the chaos of adolescence. Her protective, if not slightly overbearing mother, Ming (voice of Sandra Oh), is never far from her daughter—an unfortunate reality for the teenager. And as if changes to her interests, relationships and body weren’t enough, whenever she gets too excited (which is practically ALWAYS), she “poofs” into a giant red panda!",
    "metascore": "83",
    "userscore": "6.4",
    "link": "https://www.metacritic.com/movie/turning-red-2022"
  },
  {
    "rank": "17.",
    "title": "Belle",
    "release_date": "January 14, 2022",
    "summary": "Suzu is a shy, everyday high school student living in a rural village. For years, she has only been a shadow of herself. But when she enters “U”, a massive virtual world, she escapes into her online persona as Belle, a gorgeous and globally-beloved singer. One day, her concert is interrupted by a monstrous creature chased by vigilantes. As their hunt escalates, Suzu embarks on an emotional and epic quest to uncover the identity of this mysterious “beast” and to discover her true self in a world where you can be anyone.",
    "metascore": "83",
    "userscore": "7.7",
    "link": "https://www.metacritic.com/movie/belle-2021"
  },
  {
    "rank": "18.",
    "title": "Vortex",
    "release_date": "April 29, 2022",
    "summary": "Presented in split screen, Vortex tells the story of an aging couple in a Paris apartment. As the mother (Françoise Lebrun) faces advancing dementia, the father (Dario Argento) tries to care for her while dealing with his own declining health, and their son (Alex Lutz) does his best in spite of his own significant personal problems.",
    "metascore": "82",
    "userscore": "6.5",
    "link": "https://www.metacritic.com/movie/vortex"
  },
  {
    "rank": "19.",
    "title": "Poly Styrene: I Am a Cliché",
    "release_date": "February 2, 2022",
    "summary": "The death of punk icon and X-Ray Spex front-woman Poly Styrene sends her daughter on a journey through her mother's archives in this intimate documentary.",
    "metascore": "82",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/poly-styrene-i-am-a-cliche"
  },
  {
    "rank": "20.",
    "title": "Navalny",
    "release_date": "April 11, 2022",
    "summary": "In August 2020, Alexei Navalny survived an assassination attempt by poisoning with a lethal nerve agent. During his months-long recovery he, the investigative journalism outlet Bellingcat, and other international news organizations make shocking discoveries about the attempt on his life.",
    "metascore": "82",
    "userscore": "6.6",
    "link": "https://www.metacritic.com/movie/navalny"
  },
  {
    "rank": "21.",
    "title": "A Hero",
    "release_date": "January 7, 2022",
    "summary": "Rahim is in jail for a debt he hasn't been able to pay. During a two-day leave, he tries to convince his creditor to withdraw his complaint in exchange for paying back part of the debt. Rahim is then confronted with a crisis he would never have imagined.",
    "metascore": "82",
    "userscore": "7.8",
    "link": "https://www.metacritic.com/movie/a-hero"
  },
  {
    "rank": "22.",
    "title": "The Northman",
    "release_date": "April 22, 2022",
    "summary": "From visionary director Robert Eggers comes The Northman, an action-filled epic that follows a young Viking prince on his quest to avenge his father’s murder. With an all-star cast that includes Alexander Skarsgård, Nicole Kidman, Claes Bang, Anya Taylor-Joy, Ethan Hawke, Björk, and Willem Dafoe.",
    "metascore": "82",
    "userscore": "7.5",
    "link": "https://www.metacritic.com/movie/the-northman"
  },
  {
    "rank": "23.",
    "title": "Everything Everywhere All at Once",
    "release_date": "March 25, 2022",
    "summary": "An aging Chinese immigrant is swept up in an insane adventure, where she alone can save the world by exploring other universes connecting with the lives she could have led.",
    "metascore": "81",
    "userscore": "7.4",
    "link": "https://www.metacritic.com/movie/everything-everywhere-all-at-once"
  },
  {
    "rank": "24.",
    "title": "Top Gun: Maverick",
    "release_date": "May 27, 2022",
    "summary": "After more than thirty years of service as one of the Navy’s top aviators, Pete “Maverick” Mitchell (Tom Cruise) is where he belongs, pushing the envelope as a courageous test pilot and dodging the advancement in rank that would ground him. When he finds himself training a detachment of Top Gun graduates for a specialized mission the likes of which no living pilot has ever seen, Maverick encounters Lt. Bradley Bradshaw (Miles Teller), call sign: “Rooster,” the son of Maverick’s late friend and Radar Intercept Officer Lt. Nick Bradshaw, aka “Goose.”  Facing an uncertain future and confronting the ghosts of his past, Maverick is drawn into a confrontation with his own deepest fears, culminating in a mission that demands the ultimate sacrifice from those who will be chosen to fly it.",
    "metascore": "81",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/top-gun-maverick"
  },
  {
    "rank": "25.",
    "title": "Cow",
    "release_date": "April 8, 2022",
    "summary": "This intimate portrait of one dairy cow’s life highlights the beauty and challenges cows face, and their great service to us all.",
    "metascore": "80",
    "userscore": "7.5",
    "link": "https://www.metacritic.com/movie/cow"
  },
  {
    "rank": "26.",
    "title": "The White Fortress",
    "release_date": "April 22, 2022",
    "summary": "In the rundown Sarajevo suburb of Alipasino Polje, Faruk is an orphan who lives with his ill grandmother and spends his days foraging for scrap metal and dabbling in petty crime.  One day he meets Mona, a timid teen from a politically powerful and affluent family. As Mona dreams of escaping the overbearing toxicity of her home life, she seeks refuge and opens herself up to Faruk, a boy from a world entirely different than her own.",
    "metascore": "79",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-white-fortress"
  },
  {
    "rank": "27.",
    "title": "All My Friends Hate Me",
    "release_date": "March 11, 2022",
    "summary": "A college reunion goes awry when Pete suspects his friends may be out to get him. . . As their weekend getaway grows more and more uncomfortable, should Pete be worried about his safety, or is it all in his head? [Super LTD]",
    "metascore": "79",
    "userscore": "6.8",
    "link": "https://www.metacritic.com/movie/all-my-friends-hate-me"
  },
  {
    "rank": "28.",
    "title": "Ahed's Knee",
    "release_date": "March 18, 2022",
    "summary": "A celebrated Israeli filmmaker named Y arrives in a remote desert village to present one of his films at a local library. Struggling to cope with the recent news of his mother’s terminal illness, he is pushed into a spiral of rage when the host of the screening, a government employee, asks him to sign a form placing restrictions on what he can say at the film’s Q\u0026A. Told over the course of one day, the film depicts Y as he battles against the loss of freedom in his country and the fear of losing his mother.",
    "metascore": "79",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/aheds-knee"
  },
  {
    "rank": "29.",
    "title": "Apollo 10½: A Space Age Childhood",
    "release_date": "March 25, 2022",
    "summary": "Apollo 10 ½: A Space Age Childhood tells the story of the first moon landing in the summer of 1969 from two interwoven perspectives – the astronaut and mission control view of the triumphant moment, and through the eyes of a kid growing up in Houston, Texas who has intergalactic dreams of his own. Taking inspiration from Academy Award-nominated® filmmaker Richard Linklater’s own life, Apollo 10 ½: A Space Age Childhood is a snapshot of American life in the 1960s that is part coming of age, part societal commentary, and part out-of-this-world adventure. [Netflix]",
    "metascore": "79",
    "userscore": "6.5",
    "link": "https://www.metacritic.com/movie/apollo-10"
  },
  {
    "rank": "30.",
    "title": "Lunana: A Yak in the Classroom",
    "release_date": "January 21, 2022",
    "summary": "A disillusioned schoolteacher is transferred to the most remote school in the world, cut off from modern life deep in the Himalayan glaciers.  In a classroom with no electricity or even a blackboard, he finds himself with only a yak and a song that echoes through the mountains.",
    "metascore": "79",
    "userscore": "7.4",
    "link": "https://www.metacritic.com/movie/lunana-a-yak-in-the-classroom"
  },
  {
    "rank": "31.",
    "title": "After Yang",
    "release_date": "March 4, 2022",
    "summary": "When his young daughter's beloved companion — an android named Yang — malfunctions, Jake (Colin Farrell) searches for a way to repair him. In the process, Jake discovers the life that has been passing in front of him, reconnecting with his wife (Jodie Turner-Smith) and daughter across a distance he didn't know was there.",
    "metascore": "79",
    "userscore": "7.2",
    "link": "https://www.metacritic.com/movie/after-yang"
  },
  {
    "rank": "32.",
    "title": "You Won't Be Alone",
    "release_date": "April 1, 2022",
    "summary": "In an isolated mountain village in 19th-century Macedonia, a young girl is taken from her mother and transformed into a witch by an ancient, shape-shifting spirit. Left to wander feral, the young witch beholds the natural world with curiosity and wonder. After inadvertently killing a villager and assuming her body, she continues to inhabit different people, living among the villagers for years, observing and mimicking their behavior until the ancient spirit returns, bringing them full circle.",
    "metascore": "79",
    "userscore": "6.2",
    "link": "https://www.metacritic.com/movie/you-wont-be-alone"
  },
  {
    "rank": "33.",
    "title": "Apples",
    "release_date": "June 24, 2022",
    "summary": "Amidst a worldwide pandemic that causes sudden amnesia, middle-aged Aris (Aris Servetalis) finds himself enrolled in a recovery program designed to help unclaimed patients build new identities. Prescribed daily tasks on cassette tapes so he can create new memories and document them on camera, Aris slides back into ordinary life, meeting Anna (Sofia Georgovasili), a woman who is also in recovery.",
    "metascore": "79",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/apples"
  },
  {
    "rank": "34.",
    "title": "Kimi",
    "release_date": "February 10, 2022",
    "summary": "An agoraphobic Seattle tech worker (Zoë Kravitz) uncovers evidence of a crime.",
    "metascore": "79",
    "userscore": "5.7",
    "link": "https://www.metacritic.com/movie/kimi"
  },
  {
    "rank": "35.",
    "title": "X",
    "release_date": "March 18, 2022",
    "summary": "In 1979, a group of young filmmakers set out to make an adult film in rural Texas, but when their reclusive, elderly hosts catch them in the act, the cast find themselves fighting for their lives.",
    "metascore": "78",
    "userscore": "7.0",
    "link": "https://www.metacritic.com/movie/x-2022"
  },
  {
    "rank": "36.",
    "title": "This Much I Know to Be True",
    "release_date": "May 11, 2022",
    "summary": "Explores the creative relationship and songs from Nick Cave and Warren Ellis' last two studio albums, \"Ghosteen\" and \"Carnage\".",
    "metascore": "78",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/this-much-i-know-to-be-true"
  },
  {
    "rank": "37.",
    "title": "Servants",
    "release_date": "February 25, 2022",
    "summary": "Two students of a theological seminary in totalitarian Czechoslovakia must decide if they'll choose the easier way of collaboration, or if they'll subject themselves to the surveillance of the secret police.",
    "metascore": "78",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/servants"
  },
  {
    "rank": "38.",
    "title": "Islands",
    "release_date": "April 12, 2022",
    "summary": "Still living with his aging parents, Joshua (Rogelio Balagtas), a Filipino immigrant to Canada, prays every night for God to rid him of his shyness. The Almighty seemingly answers his petition when his beatific cousin Marisol (Sheila Lotuaco) arrives and slowly transforms Joshua's house back into a home.",
    "metascore": "77",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/islands"
  },
  {
    "rank": "39.",
    "title": "Dear Mr. Brody",
    "release_date": "March 4, 2022",
    "summary": "When 21-year-old hippie-millionaire Michael Brody Jr. decided to give away his fortune to anyone in need, he ignited a psychedelic spiral of events. An instant celebrity, Brody was mobbed by the public, scrutinized by the press, and overwhelmed by the crush of personal letters responding to his extraordinary offer. Fifty years later, an enormous cache of these letters are discovered—unopened.",
    "metascore": "77",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/dear-mr-brody"
  },
  {
    "rank": "40.",
    "title": "We're All Going to the World's Fair",
    "release_date": "April 15, 2022",
    "summary": "Late on a cold night somewhere in the U.S., teenage Casey sits alone in her attic bedroom, scrolling the internet under the glow-in-the-dark stars and black-light posters that blanket the ceiling. She has finally decided to take the World’s Fair Challenge, an online role-playing horror game, and embrace the uncertainty it promises. After the initiation, she documents the changes that may or may not be happening to her, adding her experiences to the shuffle of online clips available for the world to see. As she begins to lose herself between dream and reality, a mysterious figure reaches out, claiming to see something special in her uploads.",
    "metascore": "77",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/were-all-going-to-the-worlds-fair"
  },
  {
    "rank": "41.",
    "title": "Introduction",
    "release_date": "January 21, 2022",
    "summary": "Youngho (Shin Seokho) goes to see his father who is tending to a famous patient. He surprises his girlfriend, Juwon (Park Miso), in Berlin where she is studying fashion design. He goes to a seaside hotel to meet his mother and brings his friend Jeongsoo (Ha Seongguk) with him. In each instance, he anticipates an important conversation. But sometimes a shared look, or a shared smoke, can mean as much as anything we could say to those close to us.",
    "metascore": "77",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/introduction"
  },
  {
    "rank": "42.",
    "title": "Brighton 4th",
    "release_date": "January 28, 2022",
    "summary": "Former wrestler Kakhi (played by real-life Olympic champion Levan Tediashvili) embarks on a journey from his home in the Republic of Georgia to visit his son Soso (Giorgi Tabidze) in the Russian-speaking neighborhood of Brighton Beach, Brooklyn. There he finds him living in a shabby boarding house populated by a colorful group of fellow Georgian immigrants. Soso is not studying medicine, as Kakhi believed, but is working for a moving company and has accrued a $14,000 gambling debt to a local Russian mob boss. Kakhi sets his mind to helping his hapless son out of his debt, leading to situations as often comic as they are dire.",
    "metascore": "76",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/brighton-4th"
  },
  {
    "rank": "43.",
    "title": "Flux Gourmet",
    "release_date": "June 24, 2022",
    "summary": "Set at an institute devoted to culinary and alimentary performance, a collective finds themselves embroiled in power struggles, artistic vendettas and gastrointestinal disorders.",
    "metascore": "76",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/flux-gourmet"
  },
  {
    "rank": "44.",
    "title": "Pleasure",
    "release_date": "May 13, 2022",
    "summary": "Ninja Thyberg’s debut feature film is a journey into the Los Angeles porn industry through the lens of newcomer Bella Cherry (Sofia Kappel). Strong, self-confident and determined, Bella embarks on amission to become the best at any cost.",
    "metascore": "76",
    "userscore": "5.4",
    "link": "https://www.metacritic.com/movie/pleasure"
  },
  {
    "rank": "45.",
    "title": "The Innocents",
    "release_date": "May 13, 2022",
    "summary": "Four children become friends during the bright Nordic summer. Out of sight of the adults, they discover they have hidden powers. While exploring their newfound abilities in the nearby forests and playgrounds, their innocent play takes a dark turn and strange things begin to happen.",
    "metascore": "76",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-innocents-2022"
  },
  {
    "rank": "46.",
    "title": "Good Luck to You, Leo Grande",
    "release_date": "June 17, 2022",
    "summary": "Nancy Stokes (Emma Thompson) doesn’t know good sex. Whatever it may be, Nancy, a retired schoolteacher, is pretty sure she has never had it,  but she is determined to finally do something about that. She even has a plan: It involves an anonymous hotel room, and a young sex worker who calls himself Leo Grande (Daryl McCormack). Leo is confident, dapper, and takes pride in being good at his job. He also appears to be intrigued by Nancy — one of many things to surprise her during their time together.",
    "metascore": "76",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/good-luck-to-you-leo-grande"
  },
  {
    "rank": "47.",
    "title": "Benediction",
    "release_date": "June 3, 2022",
    "summary": "Benediction explores the turbulent life of WWI poet Siegfried Sassoon (Jack Lowden). The writer and soldier was a complex man who survived the horrors of fighting in the First World War and was decorated for his bravery but who became a vocal critic of the government’s continuation of the war when he returned from service. His poetry was inspired by his experiences on the Western Front, and he became one of the leading war poets of the era. Adored by members of the aristocracy as well as stars of London’s literary and stage world, he embarked on affairs with several men as he attempted to come to terms with his homosexuality. At the same time, broken by the horror of war, he made his life’s journey a quest for salvation, trying to find it within the conformity of marriage and religion.",
    "metascore": "76",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/benediction"
  },
  {
    "rank": "48.",
    "title": "Cha Cha Real Smooth",
    "release_date": "June 17, 2022",
    "summary": "Fresh out of college and without a clear life path going forward, 22-year-old Andrew (Cooper Raiff) is stuck back at home with his family in New Jersey. But if there’s one thing that belongs on his nonexistent résumé, it’s how to get a party started, which lands him the perfect job of motivational dancing at the bar and bat mitzvahs for his younger brother’s classmates. When Andrew befriends a local mom, Domino (Dakota Johnson), and her daughter, Lola (Vanessa Burghardt), he finally discovers a future he wants — even if it might not be his own.",
    "metascore": "76",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/cha-cha-real-smooth"
  },
  {
    "rank": "49.",
    "title": "Paris, 13th District",
    "release_date": "April 15, 2022",
    "summary": "Paris, 13th District today.  Émilie meets Camille who is attracted to Nora, who crosses paths with Amber. Three girls and a boy – they’re friends, sometimes lovers and often both.",
    "metascore": "76",
    "userscore": "5.8",
    "link": "https://www.metacritic.com/movie/paris-13th-district"
  },
  {
    "rank": "50.",
    "title": "Emily the Criminal",
    "release_date": "August 5, 2022",
    "summary": "Emily (Aubrey Plaza) is saddled with student debt and locked out of the job market due to a minor criminal record. Desperate for income, she takes a shady gig as a “dummy shopper,” buying goods with stolen credit cards supplied by a middleman named Youcef (Theo Rossi). Faced with a series of dead-end job interviews, Emily soon finds herself seduced not only by the quick cash and illicit thrills of black market capitalism, but also by her ardent mentor Youcef.",
    "metascore": "75",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/emily-the-criminal"
  },
  {
    "rank": "51.",
    "title": "The Automat",
    "release_date": "February 18, 2022",
    "summary": "Before fast food we had something better. Our grandparents told us stories of gathering around communal tables, sharing their lives, their struggles, and their dreams with strangers at The Automat. Relive the phenomena of America’s original and most beloved restaurant chain with never before-seen archival footage and photographs and a cast including celebrity customers, company executives, historians, and members of the Horn \u0026 Hardart families.",
    "metascore": "75",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-automat"
  },
  {
    "rank": "52.",
    "title": "Tony Hawk: Until the Wheels Fall Off",
    "release_date": "April 5, 2022",
    "summary": "A wide-ranging, definitive look at Hawk’s life and iconic career, and his relationship with the sport with which he’s been synonymous for decades. Hawk, born in San Diego, Calif., is a pioneer of modern vertical skating and one of the most influential skateboarders of all time. [HBO]",
    "metascore": "75",
    "userscore": "6.8",
    "link": "https://www.metacritic.com/movie/tony-hawk-until-the-wheels-fall-off"
  },
  {
    "rank": "53.",
    "title": "Strawberry Mansion",
    "release_date": "February 18, 2022",
    "summary": "In the not-too-distant future, an all-seeing surveillance state conducts “dream audits” to collect taxes on the unconscious lives of the populace. Mild-mannered government agent James Preble (Kentucker Audley) travels to a remote farmhouse to audit the dreams of Arabella “Bella” Isadora (Penny Fuller), an eccentric, aging artist. Entering Bella’s vast VHS archive, which contains a lifetime of dreams, Preble stumbles upon a secret that offers him a chance at love—and hope for escape. [Sundance]",
    "metascore": "75",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/strawberry-mansion"
  },
  {
    "rank": "54.",
    "title": "On the Count of Three",
    "release_date": "May 13, 2022",
    "summary": "Val (Jerrod Carmichael) has reached a place where he feels the only way out is to end things. But he considers himself a bit of a failure—his effectiveness lacking—so he figures he could use some help. As luck would have it, Val’s best friend, Kevin (Christopher Abbott), is recovering from a failed suicide attempt, so he seems like the perfect partner for executing this double suicide plan. But before they go, they have some unfinished business to attend to. [Sundance]",
    "metascore": "74",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/on-the-count-of-three"
  },
  {
    "rank": "55.",
    "title": "Gagarine",
    "release_date": "April 1, 2022",
    "summary": "Youri, 16, has lived all his life in Gagarine Cité, a vast red brick housing project on the outskirts of Paris. From the heights of his apartment, he dreams of becoming an astronaut. But when plans to demolish his community’s home are leaked, Youri joins the resistance. With his friends Diana and Houssam, he embarks on a mission to save Gagarine, transforming the estate into his own “starship” – before it disappears into space forever.",
    "metascore": "74",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/gagarine"
  },
  {
    "rank": "56.",
    "title": "Jackass Forever",
    "release_date": "February 4, 2022",
    "summary": "Celebrating the joy of being back together with your best friends and a perfectly executed shot to the dingdong, the original jackass crew return for another round of hilarious, wildly absurd, and often dangerous displays of comedy with a little help from some exciting new cast. Johnny and the team push the envelope even further in Jackass Forever.",
    "metascore": "74",
    "userscore": "6.6",
    "link": "https://www.metacritic.com/movie/jackass-forever"
  },
  {
    "rank": "57.",
    "title": "Hatching",
    "release_date": "April 29, 2022",
    "summary": "12-year-old Tinja is desperate to please her mother, a woman obsessed with presenting the image of a perfect family. One night, Tinja finds a strange egg. What hatches is beyond belief.",
    "metascore": "74",
    "userscore": "6.4",
    "link": "https://www.metacritic.com/movie/hatching"
  },
  {
    "rank": "58.",
    "title": "You Are Not My Mother",
    "release_date": "March 25, 2022",
    "summary": "It’s the week before Halloween. Char’s bedridden mother, Angela, has mysteriously gone missing. All that remains is her abandoned car parked in the middle of a field. When Angela returns home to their North Dublin estate the following evening without explanation, it becomes clear to Char and her grandmother, Rita, that something is amiss. She might look and sound the same, but Angela’s behavior has become increasingly erratic and frightening, as if she has been replaced by a malevolent force. As Halloween approaches, a night steeped in ancient Irish myth and legend, Char must unearth the dark secrets of her family in order to uncover the truth behind her mother's disappearance and save her, even if it means potentially losing her forever.",
    "metascore": "74",
    "userscore": "4.5",
    "link": "https://www.metacritic.com/movie/you-are-not-my-mother"
  },
  {
    "rank": "59.",
    "title": "Both Sides of the Blade",
    "release_date": "July 8, 2022",
    "summary": "Sara (Juliette Binoche) and Jean (Vincent Lindon) have been in a loving, stable relationship for ten years. They are happy. He is her rock, someone she can hold on to. When they first met, Sara was in a relationship with François (Grégoire Colin), Jean’s best friend. One day, Sara sees François on the street. He does not see her, but she is overwhelmed by a sensation that her life could suddenly change. François does indeed get in touch with Jean to suggest that they work together again. Before long, things are in danger of spiralling out of control. [Berlin]",
    "metascore": "74",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/both-sides-of-the-blade"
  },
  {
    "rank": "60.",
    "title": "Il Buco",
    "release_date": "May 13, 2022",
    "summary": "During the economic boom of the 1960s, Europe’s highest building is being built in Italy’s prosperous North. At the other end of the country, young speleologists explore Europe’s deepest cave in the untouched Calabrian hinterland. The bottom of the Bifurto Abyss, 700 meters below Earth, is reached for the first time. The intruders’ venture goes unnoticed by the inhabitants of a small neighboring village, but not by the old shepherd of the Pollino plateau whose solitary life begins to interweave with the group’s journey.",
    "metascore": "74",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/il-buco"
  },
  {
    "rank": "61.",
    "title": "The Tale of King Crab",
    "release_date": "April 15, 2022",
    "summary": "Italy, today. Some elderly hunters reminisce about the local tale of Luciano. Luciano lives as a wandering drunkard in a remote village of the region called Tuscia. Spiteful actions ensue between him and the prince of the region over the right of passage through an ancient gateway. Fueled by passions and jealousy, these actions result in a horrible misdeed. Now an unfortunate criminal, Luciano is exiled to the distant Tierra del Fuego where, with the help of ruthless gold-diggers, he searches for a mythical treasure, paving his way towards redemption. However, in these barren lands, only greed and insanity can prevail.",
    "metascore": "73",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-tale-of-king-crab"
  },
  {
    "rank": "62.",
    "title": "Lucy and Desi",
    "release_date": "March 4, 2022",
    "summary": "Lucy and Desi explores the unlikely partnership and enduring legacy of one of the most prolific power couples in entertainment history. Lucille Ball and Desi Arnaz risked everything to be together. Their love for each other led to the most influential show in the history of television, I Love Lucy. Desi – an immigrant from Cuba who lost everything in exile, became a band leader, and eventually a brilliant producer and technical pioneer. Lucille came from nothing and, with an unrivaled work ethic, built a career as a model, chorus girl and eventually as an actor in the studio system. She found her calling in comedy, first in radio. When Lucille was finally granted the opportunity to have her own television show, she insisted that her real-life spouse, Desi, be cast as her husband. Defying the odds, they re-invented the medium, on the screen and behind the cameras. The foundation of I Love Lucy was the constant rupture and repair of unconditional love. What Lucy and Desi couldn’t make work with each other, they gave to the rest of the world. Lucy and Desi is an insightful and intimate peek behind the curtain of these two remarkable trailblazers – featuring interviews with Lucie Arnaz Luckinbill, Norman Lear, Desi Arnaz Jr, Carol Burnett and Bette Midler.",
    "metascore": "73",
    "userscore": "6.1",
    "link": "https://www.metacritic.com/movie/lucy-and-desi"
  },
  {
    "rank": "63.",
    "title": "Official Competition",
    "release_date": "June 17, 2022",
    "summary": "In search of significance and social prestige, a billionaire businessman decides to make a film to leave his mark. To do so, he hires the best: a stellar team formed by famous filmmaker Lola Cuevas (Penélope Cruz) and two renowned actors, both enormously talented, but with even bigger egos: the Hollywood actor Félix Rivero (Antonio Banderas) and radical theater thespian Iván Torres (Oscar Martínez). Both legends, but not exactly the best of friends. Through a series of increasingly eccentric challenges set by Lola, Felix and Iván must face not only each other, but also their own legacies.",
    "metascore": "73",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/official-competition"
  },
  {
    "rank": "64.",
    "title": "Pirates",
    "release_date": "April 1, 2022",
    "summary": "New Year’s Eve 1999. Cappo (Elliot Edusah), Two Tonne (Jordan Peters) and Kid (Reda Elazouar) drive through London in their tiny Peugeot 205, pumping a live garage set from the stereo and arguing about their Avirex jackets and Naf Naf imports. As the eighteen-year olds step into adulthood they know their lives and friendships are on the brink of change. Determined to end the century on a bang they drive from place to place in a desperate search for tickets for the best millennium party ever. In their efforts to end up somewhere, they end up closer together.",
    "metascore": "73",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/pirates-2021"
  },
  {
    "rank": "65.",
    "title": "Anaïs in Love",
    "release_date": "April 29, 2022",
    "summary": "A spirited young woman (Anaïs Demoustier) falls in love with the novelist wife of the man with whom she’s having an affair.",
    "metascore": "72",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/anais-in-love"
  },
  {
    "rank": "66.",
    "title": "Emergency",
    "release_date": "May 20, 2022",
    "summary": "Kunle (Donald Elise Watkins) and his best friend, Sean (RJ Cyler), are both seniors in college about to embark on an epic night of Spring Break parties. Sean has the whole night planned out, including every party they will hit on their “legendary tour.” Kunle is down, yet mostly concerned with finishing up his mold experiment in his lab, as his acceptance to Princeton is hinging on the results. They return to their apartment to pre-game, yet find that their roommate, Carlos (Sebastian Chacon), left the door open. As they enter with trepidation, Sean and Kunle discover a drunk, semi-conscious White female they don’t know on the floor and an oblivious Carlos, who didn’t hear her come in over the videogame blaring in his ears. Kunle wants to call the cops but Sean vehemently opposes the idea concerned how it will look when the cops show up (two Black men, one Latino man and a passed out White woman).  Together, Carlos, Sean and Kunle load the girl - who they nickname Goldilocks, but whose real name is Emma (Maddie Nichols) - into Sean’s van, with the intention of taking her somewhere safe rather than calling the police. Meanwhile, Emma’s sister, Maddy (Sabrina Carpenter), has realized that Emma left the party they were at, and begins to search for her in a drunk panic using Emma’s phone’s location. What ensues is a chaotic, hilarious, and tension- filled chase all over town as our trio grapples with their differences while attempting to bring Emma to safety.",
    "metascore": "72",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/emergency"
  },
  {
    "rank": "67.",
    "title": "The Long Walk",
    "release_date": "February 18, 2022",
    "summary": "An old Laotian scavenger living on the fringes of a near-future society exploits a ghostly companion’s ability to traverse time, hoping to prevent his mother’s suffering from a terminal illness.",
    "metascore": "72",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-long-walk"
  },
  {
    "rank": "68.",
    "title": "7 Days",
    "release_date": "March 25, 2022",
    "summary": "Set-up on a pre-arranged date by their old-fashioned Indian parents, Ravi (Karan Soni) and Rita (Geraldine Viswanathan) seemingly have nothing in common. The situation turns both awkward and enlightening when they find themselves trapped inside together for a week.",
    "metascore": "72",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/7-days"
  },
  {
    "rank": "69.",
    "title": "A Chiara",
    "release_date": "May 27, 2022",
    "summary": "Winner of the Cannes’ Directors' Fortnight Award and a rising voice of Italian cinema, filmmaker Jonas Carpignano continues his exploration of the intricacies of life in contemporary Calabria with this compelling character study of a teenager, Chiara, who gradually comes to discover that her close-knit family is not all that it seems. In this furiously paced drama, Chiara investigates her father’s disappearance just one day after her oldest sister’s birthday. As she gets closer to the difficult truth about her mysteriously missing father—and the crime syndicates that control her region— Chiara is forced to decide what kind of future she wants for herself. [Neon]",
    "metascore": "72",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/a-chiara"
  },
  {
    "rank": "70.",
    "title": "Bull",
    "release_date": "April 1, 2022",
    "summary": "Ten years after he was last seen, Bull (Neil Maskel), a vicious mob enforcer, seeks revenge on the gang that double-crossed him. He returns home to methodically track down those who betrayed him and find his beloved son. With the ominous warning: “I’m coming for all of them,” Bull stalks his former gang, leading up to a savage showdown between his wife and her mob boss father (David Hayman).",
    "metascore": "72",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/bull-2022"
  },
  {
    "rank": "71.",
    "title": "Jujutsu Kaisen 0: The Movie",
    "release_date": "March 18, 2022",
    "summary": "Yuuta Okkotsu is haunted. Ever since his childhood friend Rika died in a traffic accident, her ghost has stuck with him. But her spirit does not appear as the sweet girl Yuuta once knew. Instead, she manifests as a monstrous and powerful entity who fiercely protects him. Unable to control Rika's violent behavior, Yuuta is helpless to stop the bloodshed that follows from her brutal vengeance. As a result, when apprehended by \"Jujutsu\" sorcerers--the secret guardians of the world, trained to combat forces like Rika--Yuuta wishes to be completely isolated so that no one else can get hurt. Yet his apprehender, the master sorcerer Satoru Gojou, has different plans for him: he will join Jujutsu High School and learn to control Rika in order to help people. Now a first-year at this school, Yuuta starts to learn Jujutsu arts and combat malignant beings. Alongside his new classmates Maki Zenin, a Jujutsu weapons expert; Toge Inumaki, a spellcaster who uses his words as weapons; and Panda, a seemingly walking and talking panda bear, Yuuta begins to find his place in the world and, for once, to feel comfortable with his abilities. However, as his training progresses, Yuuta comes to learn that the dangers of the Jujutsu world go far beyond that of wicked spirits.",
    "metascore": "72",
    "userscore": "7.4",
    "link": "https://www.metacritic.com/movie/jujutsu-kaisen-0-the-movie"
  },
  {
    "rank": "72.",
    "title": "The Batman",
    "release_date": "March 4, 2022",
    "summary": "Batman ventures into Gotham City's underworld when a sadistic killer leaves behind a trail of cryptic clues. As the evidence begins to lead closer to home and the scale of the perpetrator's plans become clear, he must forge new relationships, unmask the culprit and bring justice to the abuse of power and corruption that has long plagued the metropolis.",
    "metascore": "72",
    "userscore": "7.5",
    "link": "https://www.metacritic.com/movie/the-batman"
  },
  {
    "rank": "73.",
    "title": "Montana Story",
    "release_date": "May 13, 2022",
    "summary": "Two estranged siblings (Haley Lu Richardson, Owen Teague) return home to the sprawling ranch they once knew and loved, confronting a deep and bitter family legacy against a mythic American backdrop.",
    "metascore": "71",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/montana-story"
  },
  {
    "rank": "74.",
    "title": "Catch the Fair One",
    "release_date": "February 11, 2022",
    "summary": "A Native American boxer embarks on the fight of her life when she goes in search of her missing sister.",
    "metascore": "71",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/catch-the-fair-one"
  },
  {
    "rank": "75.",
    "title": "The Survivor",
    "release_date": "April 27, 2022",
    "summary": "The film is set post-World War II and will star Ben Foster as Harry Haft, a boxer who fought fellow prisoners in the concentration camps to survive. Haunted by the memories and his guilt, he attempts to use high-profile fights against boxing legends like Rocky Marciano as a way to find his first love again.",
    "metascore": "71",
    "userscore": "6.8",
    "link": "https://www.metacritic.com/movie/harry-haft"
  },
  {
    "rank": "76.",
    "title": "Resurrection",
    "release_date": "August 5, 2022",
    "summary": "Margaret (Rebecca Hall) leads a successful and orderly life, perfectly balancing the demands of her busy career and single parenthood to her fiercely independent daughter Abbie. But that careful balance is upended when she glimpses a man she instantly recognizes, an unwelcome shadow from her past. A short time later, she encounters him again. Before long, Margaret starts seeing David (Tim Roth) everywhere — and their meetings appear to be far from an unlucky coincidence. Battling her rising fear, Margaret must confront the monster she’s evaded for two decades who has come to conclude their unfinished business. [Sundance]",
    "metascore": "70",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/resurrection"
  },
  {
    "rank": "77.",
    "title": "Sundown",
    "release_date": "January 28, 2022",
    "summary": "Neil and Alice Bennett (Tim Roth, Charlotte Gainsbourg) are the core of a wealthy family on vacation in Mexico with younger members Colin and Alexa (Samuel Bottomley, Albertine Kotting McMillan) until a distant emergency cuts their trip short. When one relative disrupts the family’s tight-knit order, simmering tensions rise to the fore.",
    "metascore": "70",
    "userscore": "6.6",
    "link": "https://www.metacritic.com/movie/sundown-2021"
  },
  {
    "rank": "78.",
    "title": "Ted K",
    "release_date": "February 18, 2022",
    "summary": "From the mind of director Tony Stone comes TED K — a bracing, cinematic journey into the tortured mind of The Unabomber. Deep in the American Rocky Mountains lived a man who sought refuge from modern society. His dark writings forewarned of a society ruled by technology. As the outside world encroached on his mountain sanctuary, he slowly became radicalized with rage. What began with small acts of sabotage, culminated with deadly bomb attacks, national media attention, and the largest manhunt in American history. Actor Sharlto Copley brings a dark intensity and unnerving intimacy to this chilling portrait of America’s most notorious and enigmatic terrorist.",
    "metascore": "70",
    "userscore": "5.6",
    "link": "https://www.metacritic.com/movie/ted-k"
  },
  {
    "rank": "79.",
    "title": "Hellbender",
    "release_date": "February 24, 2022",
    "summary": "In Hellbender, 16-year-old Izzy (Zelda Adams) suffers from a rare illness that has kept her isolated on a mountaintop with her mother (Toby Poser) her whole life. As Izzy begins to question her sickness, she pushes back against her confinement and secretly befriends Amber (Lulu Adams), another girl living on the mountain, but her newfound happiness is derailed after she eats a live worm as part of a juvenile game and finds an insatiable and violent hunger awakened within her. To understand the hunger, Izzy must learn the dark secrets of her family's past and the ancient power in her bloodline.",
    "metascore": "70",
    "userscore": "5.4",
    "link": "https://www.metacritic.com/movie/hellbender"
  },
  {
    "rank": "80.",
    "title": "The Fabulous Filipino Brothers",
    "release_date": "February 8, 2022",
    "summary": "Follows four brothers and their shenanigans.",
    "metascore": "69",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-fabulous-filipino-brothers"
  },
  {
    "rank": "81.",
    "title": "Charli XCX: Alone Together",
    "release_date": "January 28, 2022",
    "summary": "Charli XCX was riding high after an electric headline global tour in 2019. However, everything changed when the COVID-19 pandemic turned the world upside down. Lost in the early days of quarantine Charli turns to music and announces she will make an album at home in 40 days by enlisting the help of her fans online. The boundaries take Charli on a unique creative and emotional journey as she confronts mental health issues, rekindles her relationship with her boyfriend, connects with her fans, and ultimately produces the music for how i’m feeling now.",
    "metascore": "69",
    "userscore": "6.0",
    "link": "https://www.metacritic.com/movie/alone-together"
  },
  {
    "rank": "82.",
    "title": "Huda's Salon",
    "release_date": "March 4, 2022",
    "summary": "Reem, a young mother married to a jealous man, goes to Huda’s salon in Bethlehem. But this ordinary visit turns sour when Huda, after having put Reem in a shameful situation, blackmails her to have her work for the secret service of the occupiers, and thus betray her people.",
    "metascore": "69",
    "userscore": "5.6",
    "link": "https://www.metacritic.com/movie/hudas-salon"
  },
  {
    "rank": "83.",
    "title": "Here Before",
    "release_date": "February 11, 2022",
    "summary": "When a new family moves in next door to Laura (Andrea Riseborough) and her family, their young daughter, Megan, quickly captivates her, stirring up painful memories of her own daughter, Josie, who died several years previously. Before long, Laura's memories turn to obsession as Megan's unsettling behaviour begins to convince her of something supernatural. As Laura's determination to get to the bottom of it becomes all consuming, her family begins to fracture and the line between the extraordinary and the real becomes ever more obscured in this haunting story about a mother's love.",
    "metascore": "69",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/here-before"
  },
  {
    "rank": "84.",
    "title": "The Outfit",
    "release_date": "March 18, 2022",
    "summary": "An expert tailor (Mark Rylance) must outwit a dangerous group of mobsters in order to survive a fateful night.",
    "metascore": "69",
    "userscore": "7.5",
    "link": "https://www.metacritic.com/movie/the-outfit"
  },
  {
    "rank": "85.",
    "title": "The Pink Cloud",
    "release_date": "January 14, 2022",
    "summary": "After a toxic and mysterious pink cloud appeared, Giovana finds herself stuck in a flat with a man she just met, changing her life in a way she never expected.",
    "metascore": "69",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-pink-cloud"
  },
  {
    "rank": "86.",
    "title": "Downfall: The Case Against Boeing",
    "release_date": "February 18, 2022",
    "summary": "Investigators reveal how Boeing's alleged priority of profit over safety could have contributed to two catastrophic crashes within months of each other. [Netflix]",
    "metascore": "68",
    "userscore": "7.2",
    "link": "https://www.metacritic.com/movie/downfall-the-case-against-boeing"
  },
  {
    "rank": "87.",
    "title": "Chip 'n Dale: Rescue Rangers",
    "release_date": "May 20, 2022",
    "summary": "In Chip 'n Dale: Rescue Rangers, Chip and Dale are living amongst cartoons and humans in modern-day Los Angeles, but their lives are quite different now. It has been decades since their successful television series was canceled, and Chip has succumbed to a life of suburban domesticity as an insurance salesman. Dale, meanwhile, has had CGI surgery and works the nostalgia convention circuit, desperate to relive his glory days. When a former cast mate mysteriously disappears, Chip and Dale must repair their broken friendship and take on their Rescue Rangers detective personas once again to save their friend's life.",
    "metascore": "68",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/chip-n-dale-rescue-rangers"
  },
  {
    "rank": "88.",
    "title": "Fabian: Going to the Dogs",
    "release_date": "February 11, 2022",
    "summary": "Berlin, 1931. Jakob Fabian works in the advertising department of a cigarette factory by day and drifts through bars, brothels and artist studios with his wealthy and debauched friend Labude by night. When Fabian meets the beautiful and confident Cornelia, he manages to shed his pessimistic attitude for a brief moment and falls in love. Not long after, he falls victim to the great wave of layoffs sweeping the city, plunging him back into a depression, while Cornelia’s career as an actress is taking off thanks to her wealthy boss and admirer – an arrangement that Fabian finds difficult to accept. But it’s not just his world that is falling apart; all of Germany is about to self-destruct.",
    "metascore": "68",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/fabian-going-to-the-dogs"
  },
  {
    "rank": "89.",
    "title": "The Unbearable Weight of Massive Talent",
    "release_date": "April 22, 2022",
    "summary": "Creatively unfulfilled and facing financial ruin, the fictionalized version of Nicolas Cage must accept a $1 million offer to attend the birthday of a dangerous superfan (Pedro Pascal). Things take a wildly unexpected turn when Cage is recruited by a CIA operative (Tiffany Haddish) and forced to live up to his own legend, channeling his most iconic and beloved on-screen characters in order to save himself and his loved ones. With a career built for this very moment, the seminal award-winning actor must take on the role of a lifetime: Nick Cage.",
    "metascore": "67",
    "userscore": "7.2",
    "link": "https://www.metacritic.com/movie/the-unbearable-weight-of-massive-talent"
  },
  {
    "rank": "90.",
    "title": "Fresh",
    "release_date": "March 4, 2022",
    "summary": "Frustrated by scrolling dating apps only to end up on lame, tedious dates, Noa (Daisy Edgar-Jones) takes a chance by giving her number to the awkwardly charming Steve (Sebastian Stan) after a produce-section meet-cute at the grocery store. During a subsequent date at a local bar, sassy banter gives way to a chemistry-laden hookup, and a smitten Noa dares to hope that she might have actually found a real connection with the dashing cosmetic surgeon. She accepts Steve’s invitation to an impromptu weekend getaway, only to find that her new paramour has been hiding some unusual appetites. [Sundance]",
    "metascore": "67",
    "userscore": "6.6",
    "link": "https://www.metacritic.com/movie/fresh-2022"
  },
  {
    "rank": "91.",
    "title": "Ray Donovan: The Movie",
    "release_date": "January 14, 2022",
    "summary": "A showdown decades in the making brings the Donovan family legacy full circle. As the events that made Ray who he is today finally come to light, the Donovans find themselves drawn back to Boston to face the past. Each of them struggles to overcome their violent upbringing, but destiny dies hard, and only their fierce love for each other keeps them in the fight. Whether they stand together or they go down swinging, one thing is certain – Ray doesn’t do loose ends.",
    "metascore": "67",
    "userscore": "6.3",
    "link": "https://www.metacritic.com/movie/ray-donovan"
  },
  {
    "rank": "92.",
    "title": "The Sky Is Everywhere",
    "release_date": "February 11, 2022",
    "summary": "Tucked among the magical redwood trees of Northern California and surrounded by her grandmother’s gargantuan roses, 17-year-old Lennie Walker, a radiant musical prodigy, struggles with overwhelming grief following the sudden loss of her older sister, Bailey. When Joe Fontaine, the charismatic new guy at school, enters Lennie’s life, she’s drawn to him. But Lennie’s complicated relationship with her sister’s devastated boyfriend, Toby, starts to affect Lennie and Joe’s budding love. Through her vivid imagination and honest, conflicted heart, Lennie navigates first love and first loss to create a song of her own.",
    "metascore": "66",
    "userscore": "5.5",
    "link": "https://www.metacritic.com/movie/the-sky-is-everywhere"
  },
  {
    "rank": "93.",
    "title": "Master",
    "release_date": "March 18, 2022",
    "summary": "Professor Gail Bishop (Regina Hall) has recently been promoted to “Master” of a residence hall, the first time at storied Ancaster College that a Black woman has held the post. Determined to breathe new life into a centuries-old tradition, Gail soon finds herself wrapped up in the trials and tribulations of Jasmine Moore (Zoe Renee), an energetic and optimistic Black freshman. Jasmine’s time at Ancaster hits a snag early on when she’s assigned a dorm room that is rumored to be haunted. Things get worse when Jasmine clashes in the classroom with Liv Beckman (Amber Gray), a professor in the middle of her own racially charged tenure review. As Gail tries to maintain order and fulfill the duties of a Master, the cracks begin to show in Ancaster’s once-immaculate facade. After a career spent fighting to make it into Ancaster’s inner circle, Gail is confronted with the horrifying prospect of what lies beneath, her question ultimately becoming not whether the school is haunted, but by whom.",
    "metascore": "66",
    "userscore": "4.6",
    "link": "https://www.metacritic.com/movie/master-2022"
  },
  {
    "rank": "94.",
    "title": "Men",
    "release_date": "May 20, 2022",
    "summary": "In the aftermath of a personal tragedy, Harper (Jessie Buckley) retreats alone to the beautiful English countryside, hoping to have found a place to heal. But someone or something from the surrounding woods appears to be stalking her. What begins as simmering dread becomes a fully-formed nightmare, inhabited by her darkest memories and fears.",
    "metascore": "66",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/men"
  },
  {
    "rank": "95.",
    "title": "The Phantom of the Open",
    "release_date": "June 3, 2022",
    "summary": "Maurice Flitcroft (Mark Rylance), a dreamer and unrelenting optimist, managed to gain entry to The British Open Golf Championship Qualifying in 1976 and subsequently shot the worst round in Open history, becoming a folk hero in the process.",
    "metascore": "65",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/the-phantom-of-the-open"
  },
  {
    "rank": "96.",
    "title": "Operation Mincemeat",
    "release_date": "May 6, 2022",
    "summary": "It’s 1943. The Allies are determined to break Hitler’s grip on occupied Europe, and plan to launch an all-out assault on Sicily; but they face an impossible challenge - how to protect the invasion force from potential annihilation. It falls to two remarkable intelligence officers, Ewen Montagu (Colin Firth) and Charles Cholmondeley (Matthew Macfadyen) to dream the most inspired and improbable disinformation strategy of the war - centered on the most unlikely of secret agents: a dead man. [Netflix]",
    "metascore": "65",
    "userscore": "6.0",
    "link": "https://www.metacritic.com/movie/operation-mincemeat"
  },
  {
    "rank": "97.",
    "title": "Call Jane",
    "release_date": "October 28, 2022",
    "summary": "Chicago, 1968. As a city and the nation are poised on the brink of violent political upheaval, suburban housewife Joy leads an ordinary life with her husband and daughter. When Joy’s pregnancy leads to a life-threatening condition, she must navigate a medical establishment unwilling to help. Her journey to find a solution to an impossible situation leads her to the “Janes,” a clandestine organization of women who provide Joy with a safer alternative — and in the process, change her life. [Sundance]",
    "metascore": "65",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/call-jane"
  },
  {
    "rank": "98.",
    "title": "Honk for Jesus. Save Your Soul.",
    "release_date": "September 2, 2022",
    "summary": "As the proud first lady of a Southern Baptist megachurch, Trinitie Childs (Regina Hall) carries immense responsibility on her shoulders. Her church, Wander To Greater Paths, once served a congregation in the tens of thousands, but after a scandal involving her husband, Pastor Lee-Curtis Childs (Sterling K. Brown), forced the church to close temporarily, Trinitie is struggling to manage the aftermath. Now Trinitie and Lee-Curtis must rebuild their congregation and reconcile their faith by all means necessary to make the biggest comeback that commodified religion has ever seen.",
    "metascore": "65",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/honk-for-jesus-save-your-soul"
  },
  {
    "rank": "99.",
    "title": "Air Doll (2009)",
    "release_date": "February 4, 2022",
    "summary": "A life-size blow-up doll develops a soul and falls in love with a video store clerk.",
    "metascore": "65",
    "userscore": "7.4",
    "link": "https://www.metacritic.com/movie/air-doll"
  },
  {
    "rank": "100.",
    "title": "Watcher",
    "release_date": "June 3, 2022",
    "summary": "As a serial killer stalks the city, Julia (Maika Monroe) – a young actress who just moved to town with her boyfriend – notices a mysterious stranger watching her from across the street.",
    "metascore": "65",
    "userscore": "tbd",
    "link": "https://www.metacritic.com/movie/watcher"
  }
]